[{"tweet":"🔌 All appliances cost money to run, but do you know how much different things are setting you back each month?   We've made this handy guide to break down the cost of some of the most used household appliances, with tips on how to save your usage.  "},{"tweet":"Energy costs are rising.   But there are some quick and simple things you can do to save money on your energy bills.   Here are top hacks to help you save £564 a year ⤵️    "},{"tweet":"Tips to save on heating bill as energy costs rise [Video]"},{"tweet":"Looking for ways to save on your energy bill and decreasing your carbon footprint? Check out our energy tip ."},{"tweet":"Looking for ways to save on your energy bill and decreasing your carbon footprint? Check out our energy tip ."},{"tweet":"What are some low-cost ways to save energy this winter?  🌬️ draughtproofing 🪟 secondary glazing 🔥 understand your heating controls 💦 boiler jacket   More ideas here..."},{"tweet":"Looking for an easy way to save energy? These two laundry tips will help!"},{"tweet":"Tip 2 -  ☕️ Just enough for one cuppa...  It's simple, yet effective!  Boil what you need and save £20 - £35 a year.  Though if your tea colour is between A1 and A3, maybe tea isn't for you 😂 Wh...    "},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"As your trusted energy partner, MLEC is here w tips\/programs to help you save energy! For more tips and what programs we offer, visit Also, check out Ways to Save with Wagner in The Tennessee Magazine each month!"},{"tweet":"Did you know that an 1\/8” gap under your door lets in as much air as if the door had a 2 ¼” hole?  Sealing off leaks saves you money year-round! 💸 "},{"tweet":"Fall into energy savings with this tip... Seal all leaks around doors, windows, and electrical outlets to save up to 20% on your heating bill. The cost of materials is typically under $20."},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"Turning off your TV or monitors not only saves you energy, but it also keeps your rooms cooler. That is just one of many ways you can save energy. For more visit:"},{"tweet":"Don’t let your appliances go too long without inspecting them from time to time! Performing regular preventative maintenance on your household appliances such as cleaning the coils, vents, and filters helps that efficiency and saves you money on your energy bill! 💸 "},{"tweet":"If You buy 1000 kettles just think how much money you could save!"},{"tweet":"How much money can you actually save by turning off lights around your house? via"},{"tweet":"Solar wins. The Biden administration wants to show Americans that they can save money on their energy bills by going green. via"},{"tweet":"The Energy Services team at BEC is ready to help you save money with a Free energy audit! They will test the efficiency of your home &amp; offer recommendations on how to make improvements &amp; save money &amp; energy! Call today to schedule an audit!"},{"tweet":"Don't turn on your stove today. Keep your home cool and save energy with a slow cooker or outdoor grill. A slow-cooking, electric crockpot uses half the electricity of a conventional oven."},{"tweet":"Hoping to save some energy this hot week? Close drapes, shades and blinds during the day to prevent the sun from heating your home unnecessarily. Open windows and doors in the early morning and in the evening to let cooler air in."},{"tweet":"TIP: Washing larger loads of laundry will save water and energy.  ANOTHER TIP: this should also reduce time thinking about laundry  "},{"tweet":"Want to save some money on your home's energy costs? Here are ten ideas that should have an immediate positive effect.     Anna Karelis Global Real Estate Advisor NV S. 0196050 CA..."},{"tweet":"\"Standby power can account for 10% of an average household's annual electricity use. Unplug unused electronics and save $50 a year.\"   @bchydro   "},{"tweet":"Wash in the savings! Little changes can make a difference and help save energy and 💲💲💲! ✔️Turn of the water while scrubbing ✔️Run full loads in the dishwasher ✔️Wash clothes in cold water ✔️Dry heavy items separate from lighter items "},{"tweet":"Here are some more easy ways to save energy (and dollars) this summer!"},{"tweet":"It's convenient to keep your electronics plugged in, but did you know they still drain energy while not in use? Unplug and save."},{"tweet":"It's convenient to keep your electronics plugged in, but did you know they still drain energy while not in use? Unplug and save. For more click on the link."},{"tweet":"Looking for ways to save energy this summer? Check for free energy workshops with our partners at"},{"tweet":"\"Two 100-watt incandescent bulbs switched off an extra two hours per day could save you $15 over a year. Better yet, switch to LED.\" @user @user    "},{"tweet":"DID YOU KNOW?   ℹ️ Our appliances are still consuming energy even when they are on standby mode?  📺 You could save up to £55 a year just by remembering to switch your appliances off at the plug.  "},{"tweet":"You can have an impact on your energy usage during the summer months. Stay cool and save money by following our tips, like keeping shades, blinds and curtains closed. More tips here:"},{"tweet":"You can have an impact on your energy usage during the summer months. Stay cool and save money by following our tips, like switching to a cold laundry cycle. More tips here:"},{"tweet":"Replacing air filters is one of the easiest &amp; most effective things you can do to make sure that your energy costs are as low as possible. Replacing a dirty filter with a clean one can lower your A\/C’s energy usage by up to 15% &amp; save you money! "},{"tweet":"Here’s a video I put together with some quick, easy tips you can daily to save money on your energy bill during the summer. ⁦@DukeEnergy⁩"},{"tweet":"DYK you can save energy by planting shade trees and bushes?  "},{"tweet":"Summer is here! Reduce unnecessary heat in your home by detecting leaks in windows and doors, then caulking and sealing them. Visit for more ways to save."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Vacation planned? Before you leave out, save energy and 💲💲💲 by setting your thermostat to 78 degrees or above. If you have a programmable or smart thermostat, you can program it so the settings will change automatically."},{"tweet":"Looking for ways to save at home this summer? Check out our latest blog here:"},{"tweet":"Energy hacks that help you save!  - Set your fridge temp between 35 - 38 degrees - Set your freezer temp to 0 - 5 degrees - Reduce the brightness function on your TV Learn more and save more💲with these from @user   "},{"tweet":"Cooler days are a good time to open windows and create a cross breeze in your home. You’ll naturally create a cooler temperature without the use of your air conditioner. Visit for more ways to save."},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Most water heaters are set to 140° Fahrenheit, which not only is unnecessarily high but is also making your home hotter. Turning the temperature down to 120° could save you 10% on your energy bills."},{"tweet":"Taking advantage of warm spring days could save you on Cooking outside can avoid heating up your home and uses less energy to get dinner on the table."},{"tweet":"Today’s washing detergents are very effective at 30 degrees, so try washing laundry on a lower setting than normal. Wait until you have a full load too. Use an eco-wash setting if you can, as this will save on your bills in the long term.  "},{"tweet":"Trevor Ross Realtor-CENTURY 21 Dreams Inc.Instead of streaming on your TV, consider watching shows on a more energy-efficient device like a laptop or tablet. Turn down the brightness and volume of your device to save on power!   "},{"tweet":"Instead of streaming on your TV, consider watching shows on a more energy-efficient device like a laptop or tablet. Turn down the brightness and volume of your device to save on power!   "},{"tweet":"Trevor Ross Realtor-CENTURY 21 Dreams Inc.Both LEDs and CFLs bulbs are more efficient than halogen lights. Replacing a halogen light bulb with an LED of the same brightness and could save you on energy costs!  "},{"tweet":"Both LEDs and CFLs bulbs are more efficient than halogen lights. Replacing a halogen light bulb with an LED of the same brightness and could save you on energy costs!  "},{"tweet":"Trevor Ross Realtor-CENTURY 21 Dreams Inc.Turning down your thermostat by just one degree could save you money!  "},{"tweet":"Turning down your thermostat by just one degree could save you money!  "},{"tweet":"Trevor Ross Realtor-CENTURY 21 Dreams Inc.With energy bills rising, simple changes to your daily habits can have a huge impact on the amount of energy you’re using at home! I will be sharing with you some tips on how to save on energy!    …"},{"tweet":"With energy bills rising, simple changes to your daily habits can have a huge impact on the amount of energy you’re using at home! I will be sharing with you some tips on how to save on energy!   "},{"tweet":"Save 1% on your energy bill for every degree you turn your thermostat🌡️ down this winter. Learn how to save more here:  "},{"tweet":"If you would like to know any more about how to save energy in your home give us a call. "},{"tweet":"Did you know that even a 1-degree adjustment on your water heater's temperature setting can help save you money this winter? Turn yours down this winter and save.  Learn more here:   "},{"tweet":"Saving money for heating costs: When you have to heat, your home in the winter you need to think about it all year long. You should think of the ways that you can save money during the summer months so that you are not finding…"},{"tweet":"Saving heat with your clothes dryer, exhaust duct: You need to be careful when you are trying to save money on your heating costs. You have to think ahead so that you are not losing your money when you are trying to heat your…"},{"tweet":"Dressing for the cold to save your heating bills: You need to make sure that when the weather is colder outside you have to be ready for it. You need to make sure that you are dressing for the weather and keeping yourself…"},{"tweet":"It can be confusing to know how to use your heating system efficiently.   We've collated some advice on the most common heater types, from radiators to storage heaters, to help you keep warm and save energy 🔥👇https:\/\/t.co\/HJawFO5gAJ"},{"tweet":"We many never know. At least you can save money by switching to energy-saving LED lightbulbs.  "},{"tweet":"How to save energy at home – 24 energy-saving tips you need to know...  Worried about soaring gas prices? Learn how to save energy at home to lower gas and electricity bills and save precious cash.  Read more here.   "},{"tweet":"Want to save (at least) 3% on your   It's simple.   In the winter, set the at 68. Your heating cost will increase 3% for each degree about 68.   What do you leave your on?  "},{"tweet":"Looking for an easy way to save energy? These two laundry tips will help!"},{"tweet":"Want to make your clothes last longer and save big on Ditch the heat and air dry your clothes when possible. 👗"},{"tweet":"As energy prices in the UK continue to soar, we have created a list of simple ways we can all save energy (and money) from the comfort of our homes. Read the blog to find out how to reduce your energy footprint...  "},{"tweet":"4 ways to this evening! You &amp; your energy bill can have a relaxing evening with these simple cost-saving tips:   Call team to learn about our suite of energy services &amp; save even more: 800-327-9615  "},{"tweet":"Be a weekend energy warrior! Cover your losses with this simple strategy for closing gaps around ductwork:   Call team to learn about our suite of energy services &amp; save big: 800-327-9615  "},{"tweet":"Have you decided to replace your old incandescent bulbs with new bulbs to save on energy? 💡  To save energy, find the bulbs with the lumens you need, and then choose the one with the lowest wattage.   Here is a link for a conversion chart:   "},{"tweet":"6 ways to save with your home appliances! These easy, no-cost measures can help you start saving today:   To save even MORE, call team &amp; learn about our suite of energy services: 800-327-9615  "},{"tweet":"💡Try MoveMeIn’s innovative Power Bill Reading Technology today🙌! Upload your power bill and see just how much you could save 💲 💲 💲  "},{"tweet":"Today's detergents are very effective at 30 degrees celcius; avoiding washing laundry at a higher temperature which saves water as well as energy. Use an eco-wash setting if possible, to save on your bills in the long term.  "},{"tweet":"Today is National So, we're sharing some of our favorite tips to help you save on your energy bill.  "},{"tweet":"Today is national cut your energy costs day! Want to save some cash? Follow our easy tips!  "},{"tweet":"Baby, it's COLD outside! Learn how to save 💰 when decorating for the holidays &amp; around your home this winter.   "},{"tweet":"Baby, it's COLD outside! Learn how to save 💰 when decorating for the holidays &amp; around your home this winter.   "},{"tweet":"The 🎁 holidays can get pricey, save money where you can! 💡💲"},{"tweet":"Americans spend an extra $645 million running holiday lights in December. ✨🎄   Don’t let your energy usage skyrocket this holiday season. These tips will help you save energy— and money— as you celebrate.  Read more holiday 👉 "},{"tweet":"One of the best ways to save energy during the holiday season is using a timer to control your holiday lighting. "},{"tweet":"Day 2 of energy efficiency! One of the best ways to save energy during the holiday season is using a timer to control your holiday lighting. "},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"Brighten up the holiday season with LED lights to save. Or deck the halls outside with solar-powered lighting. No electricity required."},{"tweet":"It's fall but still warm enough to kick your AC on. If you're gone more than 4 hours, adjust your  thermostat to a warmer temp to save energy and money. . . . "},{"tweet":"Energy-saving tip: Switch to a low-flow showerhead. You’ll save water by using less per minute and save energy because you’ll have less water to heat. See more tips at . "},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"It's that time of year! Caulk around your windows for increased energy efficiency this season. Looking for more ways to save? Check out our energy calculators:   "},{"tweet":"Brighten up your Fall outdoor decor with LED lights and save! Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Given the current state of the energy market and the increase in prices going forward, we've put together a few tips to help you save money on your energy bill. Do you have any energy saving tips of your own? Let us know below 👇 "},{"tweet":"Fall into energy savings with this tip... Seal all leaks around doors, windows, and electrical outlets to save up to 20% on your heating bill. The cost of materials is typically under $20."},{"tweet":"Today, on the blog, learn how to save energy in the laundry room. Read now:  "},{"tweet":"Use a microwave oven instead of a conventional oven to save money and keep your kitchen cooler."},{"tweet":"Brighten up your yard with LED lights and save money. Or, opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Did you know…? That switching your gas boiler heating system to a will save 850kg of emissions per year?  "},{"tweet":"If you have an old air conditioning unit, it likely is not as energy efficient as a new model. Having a new unit installed will save and be cost effective long-term."},{"tweet":"This is a little reminder to not leave your appliances on standby when you're not using them. And especially while you're away. Make sure that you turn your plugs off to save energy.   "},{"tweet":"We love this fun way provides summer saving tips to help manage energy use and save money. "},{"tweet":"Make sure you regularly review your workplace heating settings to stop wasting energy and save money on bills"},{"tweet":"As summer kicks off, you'll see lots of to help you conserve energy and save money. But you can't manage what you don't measure. That's where Copper's solutions come in. Contact us to learn more! "},{"tweet":"As the days get cooler, set your heating between 18 to 20 degrees. You’ll stay warm and save on energy and bills (as every degree warmer can increase energy usage by 10 per cent). More winter energy tips at"},{"tweet":"It's another hot day! Keep window coverings closed today to block the sun’s heat. Use a ceiling or oscillating fan to cool the room you are in and turn up your thermostat a few degrees to save energy and money."},{"tweet":"Keep your home cooler (and save money) by cooking meals outdoors. What are your favorite foods to BBQ this time of year?"},{"tweet":"Most water heaters are set to 140° Fahrenheit, which not only is unnecessarily high but is also making your home hotter. Turning the temperature down to 120° could save you 10% on your energy bills."},{"tweet":"As temperatures rise, cooking in the kitchen can make for very hot work! Fire up the grill and keep your appliances OFF to save energy, money, and keep your house cool."},{"tweet":"Looking for some low-cost ways to save energy this summer? Check out our recent blog:"},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Today's energy tip: Don't leave your electronics on all day long. Only turn on your computer, monitor, printer and fax machine when you need them. This is a great energy saver.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.   "},{"tweet":"Install weatherstripping. Sealing air leaks around doors and windows saves energy and can reduce heating and cooling costs by 10% to 30%."},{"tweet":"Raise your programmable thermostat one degree in cooling season over a 24-hour period and save approximately 3% on your heating bill. Get more in the blog!  RT"},{"tweet":"Raise your programmable thermostat one degree in cooling season over a 24-hour period and save approximately 3% on your heating bill. Get more in the blog!"},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — no electricity required.  "},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Planting trees and shrubs around your home will help save money on your energy bills by blocking cold winds."},{"tweet":"Brighten up your yard with LED lights to save on electricity costs. Better yet, opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Summer's coming and you can save energy by having your A\/C serviced to ensure it's in prime condition for the hot months. Maintaining your A\/C not only keeps it working efficiently but also prolongs the life of the unit.  "},{"tweet":"Looking to save on your energy in your current (or upcoming!) home?  Whether you own your own home or rent a property, follow these simple steps to reduce your energy bills and help save the planet:   "},{"tweet":"Washing laundry in cold water, running the dishwasher when it's full, and taking shorter showers will scale back your hot water usage and save money."},{"tweet":"Fix leaky faucets and save. According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year."},{"tweet":"(click photo) It's true! If you want to do everything you can to save on electric, these tips are a good place to start.  When you're ready for more energy efficiency in your life, you can call We Are More. ⚡️  "},{"tweet":"Filling empty space and keeping your fridge stocked can help save on your energy bills."},{"tweet":"Upgrading to energy efficient Energy Star appliances is a great way to save money on your power bill."},{"tweet":"According to the U.S. Department of Energy, most households could save $2,200 every year by incorporating energy efficient products and improvements. Read the blog to start saving:   "},{"tweet":"Fix leaky faucets and save. According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year."},{"tweet":"We're expecting a big 3-day flurry here in Colorado, so be sure to follow tip on remembering to insulate! Keep heat where it belongs with proper insulation in attics and walls, you'll save energy 24\/7.   Keep that house warm!"},{"tweet":"7 quick tips to save money on your utility bills right now via"},{"tweet":"Did you know?  Coweta-Fayette EMC now has a second episode of our new podcast, \"In The Loop\"! You will learn tips of how to save energy and money. Listen &amp; subscribe here:   "},{"tweet":"When it's time to upgrade, purchase A-rated appliances. An A-rated appliance uses about 55% less electricity than a similar D rated appliance, helping you to save money and energy. For more energy saving tips visit our website:"},{"tweet":"If you are looking to save money on your electricity bill make sure you follow these tips...  "},{"tweet":"A programmable thermostat is a great way to save energy and money! Program a lower temperature when you’re sleeping, away at work, or out of the house. "},{"tweet":"Keep the cold out! Prepare to protect your energy bill this week by weatherstriping exterior doors and windows before temperatures drop. A good seal in your home can save up to 10% on energy costs."},{"tweet":"Spending more time at home means using more electricity. SCP has some energy savings tips that will help you use less energy and save more money."},{"tweet":"Fortunately, there are a few simple ways you can reduce your heating costs and save money on your utility bill while still staying toasty in the winter.\"⁠  Here are some tips to save energy and save you money -   "},{"tweet":"It's National Cut Your Energy Costs Day! But really, shouldn't that be every day? Weatherstrip exterior doors and windows to keep the cold out! A good seal in your home can save up to 10% on energy costs. Learn more at"},{"tweet":"Check out these simple hacks that can help you save energy during your morning routine."},{"tweet":"Did you miss our blog on how to save energy at your home this winter? Don’t miss these 5 tips as the temp drops!      "},{"tweet":"Saving can benefit everyone, but not everyone saves energy in the same way. What type of energy saver are you?"},{"tweet":"The holidays can take a toll on your building's\/home's energy consumption. Check out our new blog on ways to save energy this Christmas season!   "},{"tweet":"Saving can benefit everyone, but not everyone saves energy in the same way. What type of energy saver are you?"},{"tweet":"All of that holiday baking and meal preparation can crank up your energy use. Try to bake multiple items at once, and use the oven light to check on a dish’s progress rather than opening the door. Find more ways to save energy this holiday season here."},{"tweet":"Get a bit more jingle in your pocket. Turning your thermostat down by just 1 degree can save you around £80 a year and help cut your Find out more here:"},{"tweet":"Take advantage of the sunshine and turn off the lights during the day to save more money on the bills.  Do you practice this currently? You can also trade in ur old battery for an amazing discount. 07034498318, 08181115955.  "},{"tweet":"The kitchen is undeniably one of the most-loved rooms in our homes. Here are four ways you can save in the kitchen with minimal effort.   "},{"tweet":"Did you know that smart home devices can help you save on your bills? Learn more in our latest blog:"},{"tweet":"Are your cuppas ☕️ costing more than you thought? Here’s a trick quiz question: which uses the most electricity every year? An electric oven, hob, microwave or kettle? How do you save energy at home?  Answer; Kettle"},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Here are four ways to save energy in the kitchen with minimal effort. 🍔  Cook With Smaller Appliances 🔌 Unplug Appliances When Not In Use 🏋️ Help Appliances Work Less 🍽️ Use Your Dishwasher Efficiently "},{"tweet":"Our latest blog looks at smart home technologies that can help you save on your bills! Read it here:"},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Thanksgiving is quickly approaching, and we could all use a few reminders of how to save energy in the kitchen! This holiday season, cook with smaller appliances to save energy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house for an extended period and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Heating: Cover windows &amp; save."},{"tweet":"Your energy efficiency tip of the month: Keep cold air out to save energy. Seal air leaks around pipes and gaps around chimneys and unfinished spaces behind cupboards and closets."},{"tweet":"Looking for more ways to save energy at home? Check out the energy savings plan for the family below!"},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Electric: Use cool outside air &amp; save."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"You can save on heating and cooling costs by air-sealing your home! Weather-stripping and caulk are just two low-cost solutions for saving energy &amp; money. Learn more:"},{"tweet":"According to you can easily save energy in the winter by setting the thermostat to 68°F while you're awake and setting it lower while you're asleep or away from home."},{"tweet":"October is where small steps add up to big savings in our energy usage. that an 1\/8\" gap under your door lets in as much air as if the door had a 2 ¼\" hole? Sealing off leaks saves you money year-round!"},{"tweet":"Bathroom: Fix toilet running and save."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. The best part is — No electricity required!  "},{"tweet":"Smart lights can help you save up to 25 percent on lighting in your home. Learn how in our smart home infographic:"},{"tweet":"Laundry: Use cold water and save."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save energy and money. Or opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Brighten up your yard with LED lights to save energy and money. Or opt for solar-powered outdoor lighting — No electricity required.  "},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy.  "},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy.  "},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"This is a little reminder to not leave your appliances on standby when you're not using them. Make sure that you turn your plugs off to save energy.   "},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Brighten up your yard with LED lights to save. Or opt for solar-powered outdoor lighting. No electricity required."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow showerheads and faucets to save 25–60 percent annually."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow showerheads and faucets to save 25–60 percent annually."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow showerheads and faucets to save 25–60 percent annually."},{"tweet":"Fall into energy savings with this tip... Seal all leaks around doors, windows, and electrical outlets to save up to 20% on your heating bill. The cost of materials is typically under $20."},{"tweet":"Use your oven efficiently - try and cook items together, rather than one after another. Fill every rack in your oven when it is on to save energy and turn the oven on less.  For more visit our website:"},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Spending more time at home can increase your energy usage. But there are ways you can save on your bills  "},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow showerheads and faucets to save 25–60 percent annually."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. 🍳 They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow shower heads and faucets to save 25% to 60% annually."},{"tweet":"Back to school will save families money at home:"},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"RT An easy way to save money - and help the environment - is to make your home more energy efficient. Learn how now!"},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. 🌅 Leave your oven off to save money and energy."},{"tweet":"🌅 Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy. 🌅"},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy. 🌅"},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"Here's another easy tip to save energy."},{"tweet":"Want a lower energy bill? Here are four ways to save energy at home."},{"tweet":"Two major ways to save during these hot Florida months! 🥵  Do you have any tips or tricks to lower your energy usage?  "},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"Fire up the grill 🌭 to keep power bills low. Leave your oven off to save money and energy. Get more at"},{"tweet":"🧦 Want to save on costs? Wash your clothes in cold water! This will lower bills &amp; prevent clothes from shrinking."},{"tweet":"WATCH: Feeling the heat? Check out these tips on ways to save energy at home (we're looking at you, AC and water heater!)   "},{"tweet":"Smart lights can help you save up to 25 percent on lighting in your home. Learn how in our smart home infographic:"},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy. 🌅"},{"tweet":"🌅 Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"Fire up the grill when the sun goes down to keep power bills low. Leave your oven off to save money and energy."},{"tweet":"LED lights can help save the planet, one bulb at a time via"},{"tweet":"Stay cool and save money by closing window coverings during the day to block the sun's heat. 🌞"},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Leave your oven off to save money and energy. Fire up the grill 🍔 when the sun goes down to keep power bills low. ⬇️"},{"tweet":"you an easy way to save involves your garage door?  "},{"tweet":"Staying at home? Dry your clothes outside on a clothesline if you can. The summer heat is perfect for drying your clothes and you will save approximately $.50 per load, which can really add up over time.  "},{"tweet":"We’re spotlighting energy efficiency this week with tips to save energy and lower your bill! Beat the peak! Avoid using your dishwasher and doing laundry between noon and 8pm. Save money, save energy, save the environment"},{"tweet":"We’re spotlighting energy efficiency this week with tips to save energy and lower your bill! Beat the peak! Avoid using your dishwasher and doing laundry between noon and 8pm. Save money, save energy, save the environment"},{"tweet":"Here are a couple easy and inexpensive energy saving tips that can save you money and help keep your air conditioner running longer and more efficiently. Every little bit helps."},{"tweet":"The heat is on &amp; OPPD is here with some do-it-yourself home improvements to help you save on your electricity bills this summer. Check out our tips on The Wire."},{"tweet":"During the summer, save on your cooling bill by setting your programmable thermostat as high as is comfortable and raising the set point when you're sleeping or away from home."},{"tweet":"Smart lights can help you save up to 25 percent on lighting in your home. Learn how in our smart home infographic:"},{"tweet":"Using a dishwasher instead of hand-washing saves you 5,000 gallons of water per year. If you have a dishwasher, please use it!  "},{"tweet":"Here at Green we pride ourselves in the support we offer all our members, we wanted to extend this support to anyone looking⚡️♻️  Thus, we have collated a list of 7 ways to save energy (and money)💰💚  Read -   "},{"tweet":"The top 10 ways to save on in 2020 via"},{"tweet":"Here's another useful tip to save more energy."},{"tweet":"Want to save money on your electricity bill? Get out of your kitchen this summer and fire up the grill. \/1   "},{"tweet":"To save energy, switch up your laundry routine and use cold water to wash and rinse! To save even more energy (and MONEY!) message us or visit   "},{"tweet":"Smart lights can help you save up to 25 percent on lighting in your home. Learn how in our smart home infographic:"},{"tweet":"A free and easy way to save energy is to use sunlight to brighten a room instead of artificial lights! Want to save even more? Message us or visit to learn how we can help you save both energy and money!  "},{"tweet":"An easy way to save energy is to reduce your water consumption! An example is turning off faucets when they are not in use. Want to save even more on energy? Message us or visit to learn more!  "},{"tweet":"The majority of energy used by home electronics is actually while they are turned off and plugged in, so make sure you unplug after use! If you want to save even more money on energy, message us or visit to learn how!#energy"},{"tweet":"Want to improve your business energy? check out our weekly top tips! Our energy experts are full of industry knowledge to save money, be more energy-efficient and save you hassle.   "},{"tweet":"Don't forget to adjust your computer's power to save energy."},{"tweet":"An easy way to save energy is to switch to LED bulbs! Want to save even more on energy? Message us or visit to see how we can help!  "},{"tweet":"If you have a tank insulating it can save you 3-4% in costs. If your water heater feels warm to the touch, using insulation can save you up to 16% annually in your water heating costs."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save between $100 and $250 annually."},{"tweet":"Are you still working from home?  Here's a great tip to help you save energy. "},{"tweet":"With businesses and resorts opening back up, you may be planning a getaway with your family after being cooped up. To help save energy and money while away, raise your thermostat -  no need to cool an empty house. "},{"tweet":"Tips to stay cool and save money this summer. "},{"tweet":"As our weather heats up, it's good to have some tips that help you save on your utility bills. Conserve energy by running your fully-loaded dishwasher at night, then let the dishes air-dry by skipping the heat-dry cycle.   "},{"tweet":"Did you know that the average household can save more than $2,800 over 10 years just by switching to light bulbs? What a difference a bulb makes💡! Learn more here:  "},{"tweet":"Energy tip of the day: Use fans.  Use ceiling fans to save energy year-round. Set them to rotate counterclockwise in warmer months to feel about 4° cooler. Set them to rotate clockwise in cooler months to redistribute heat that has risen to the ceiling. "},{"tweet":"Did you know something as simple as swapping out incandescent bulbs with green bulbs around your house could save an average of $240 a year, just on your electricity bill? 😧"},{"tweet":"Turning your the thermostat on your heater by one degree can save you a lot of money—around €85 and €90 a year!"},{"tweet":"Looking for an easy weekend project that can save you money? Replacing an old high-flow shower head with a more efficient model can save you money on your monthly water bill, and it takes just minutes to make the switch."},{"tweet":"Energy Tip of the Day:  Meal prep.   Food prepping doesn’t just save you time during the week, you can also save energy. Use the oven once to prep food for the week to avoid heating it up multiple times throughout the work week."},{"tweet":"Can smart home technology help you save energy at home? Check out this blog to find out:"},{"tweet":"You can save on heating and cooling costs by air-sealing your home! Weather-stripping and caulk are just two low-cost options. Learn more here:"},{"tweet":"Energy Tip of the Day: Cold wash  90% of the energy washing machines use comes from heating the water. Set your washing machine to a cold wash to save energy. Don’t worry, your clothes will still get clean and they don’t mind the cold bath."},{"tweet":"24 tips to help you save on your electric bill via"},{"tweet":"Keeping your fridge stocked can help you save on your energy bills. Fill empty space with extra water jugs and store more ice trays for top efficiency."},{"tweet":"Laundry cat has spoken 😺  Washing at 30 degrees, filling your machine each time and reducing by one wash a week can save a combined total of £25 per year on water and electricity!  "},{"tweet":"Can smart home technology help you save energy? Check out this blog to find out:"},{"tweet":"Energy saving tip number 7 ⚡  The weather is really heating up, giving us the perfect opportunity to hang the clothes outside to dry.  We have a list of 28 ways, that you can save energy during these times at home.  Link in bio 🔗  "},{"tweet":"01: If your toilet runs between uses, replace the flapper  02: Connect your downspouts to a rain barrel  03: It’s Show-Me Green Sales Tax Holiday through April 25 &amp; purchasing items help save water too!"},{"tweet":"Energy saving tip number 4 ⚡  Choosing a shower over a bath saves water. Use less, save more.  We have a list of 28 ways, that you can save energy during these times at home.  Link in bio 🔗  "},{"tweet":"Did you know there are many ways you can save in your home? Here's a fun word search with tips for the energy explorers in your home."},{"tweet":"What type of saver are you? Read this blog post to find out!"},{"tweet":"Energy saving tip number 3 ⚡  Unless your clothing is really dirty, select a low temperature wash for the same results.   We have a list of 28 ways, that you can save energy during these times at home.  Link in bio 🔗  "},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"As we are all spending more time at home, here are our top five to save on your energy bill! "},{"tweet":"Energy saving tip number 2 ⚡  Turns off lights and switches in rooms that are not in use 💡  We have a list of 28 ways, that you can save energy during these times at home.  Link in bio 🔗 "},{"tweet":"We have a series of energy saving tips coming your way to help you conserve energy whilst you Stay at home.   We have a list of 28 ways you can save on our website.     "},{"tweet":"What type of saver are you? Read this blog post to find out!"},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"Can smart home technology help you save at home? Learn more in this blog post:"},{"tweet":"If you’re using your electronic devices more than usual, turn on the ‘power saver’ or ‘low power mode’ setting on your laptop, tablet, cell phone, and other devices to help extend the battery life and reduce the need to charge as often."},{"tweet":"24 tips to help you save on your electric bill via"},{"tweet":"It is starting to heat up in Texas!   Learn more about how to save on energy costs as ☀️ spring and summer ☀️ get closer and temperatures rise at 🔥!"},{"tweet":"Can smart home technology actually help you save on your power bill? Check out our latest blog to find out:"},{"tweet":"Did you know that appliances account for up to 30% of your electricity bill? Switching them off at the powerpoint when you’re not using them can save up to 7% on your bill. For more energy saving tips visits"},{"tweet":"Can smart home technology actually help you save on your power bill? Check out our latest blog to find out:"},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"Looking for an easy, low-cost way to save at home? Turn your thermostat back a few degrees before heading out for the day. Learn more:"},{"tweet":"Energy tip: By adjusting your thermostat just one degree, you can save 4-5% in energy usage. Plus, smart thermostats and controls can take human forgetfulness out of the equation.  Get more tips in this video.   "},{"tweet":"Can smart home technology actually help you save on your power bill? Check out our latest blog to find out:"},{"tweet":"Looking for easy ways to save energy without breaking the rules of your lease? You can use up to 90 percent less energy on lighting your home by upgrading to LEDs."},{"tweet":"You can save quite a bit of energy and money if you are good about shutting off electronics that use phantom energy. Like TVs, microwaves, speakers, charging devices, etc.  "},{"tweet":"Looking for an easy, low-cost way to save at home? Turn your thermostat back a few degrees before heading out for the day. Learn more tips here:"},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"Thinking of updating your appliances?  A dishwasher built before 1994 wastes more than 10 gallons of water per cycle than dishwashers built recently. If you can upgrade the old machine, you will save a lot of money!  "},{"tweet":"Looking for easy ways to save energy without breaking the rules of your lease? You can use up to 90 percent less energy on lighting your home by upgrading to LEDs."},{"tweet":"You can save on heating &amp; cooling costs by air-sealing your home! Weather-stripping and caulk are just two low-cost solutions for saving Learn more:"},{"tweet":"Save on 🌡️  Draught-proofing windows and doors, and blocking cracks in floors and skirting boards can save around £20 a year on energy bills.  "},{"tweet":"Save on appliances 💻  Turning your appliances off can save you £30 a year!   And remember not to leave laptops and mobile phones on charge unnecessarily; a phone charger still uses even if your phone isn't plugged in.📱  "},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"We know not everyone can make our events for so we're bringing the advice to you!  We'll be sharing from different groups all week, in the hope we can save you some money and   "},{"tweet":"Did you know? If you switch to 100% cold water washes, you can save about $130 a year!   Don't wash your clothes with warm water unless the labels on the clothing explicitly states that is necessary.  "},{"tweet":"What type of saver are you? Read this blog post to find out!"},{"tweet":"Remember to plug and seal the chimney flue if you have finished using the fireplace this winter to prevent heat loss and save energy. 🔥  "},{"tweet":"Energy tip: By adjusting your thermostat just one degree, you can save 4-5% in energy usage. Plus, smart thermostats and controls can take human forgetfulness out of the equation.  Get more tips in this video.   "},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"Did you know that smart thermostats can save you 10 to 12 percent in heating costs? Here are 5 reasons why smart thermostats are worth the cost:  "},{"tweet":"Start 2020 off right by making the switch to power strips. Use a power strip for electronic devices and turn it off when not in use to save on energy costs."},{"tweet":"If you resolved to spend less and save more in 2020, cutting back on a few regular expenses is a great place to start.  Today is National Cut Your Energy Costs Day, so we’ve rounded up a few ways to help trim your utility bills.  "},{"tweet":"Start 2020 off right by making the switch to power strips. Use a power strip for electronic devices and turn it off when not in use to save on energy costs."},{"tweet":"Is your home properly insulated?   The Department of Energy claims that you can save up to 50% on your next heating bill just by properly insulating your home.   "},{"tweet":"Doing laundry this week?  Wool dryer balls absorb moisture, doubling their effectiveness at reducing the time needed to dry your clothes. You save money and time!   "},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"Do you own a dishwasher? Use it!  Washing dishes with a dishwasher saves you an average of $40 per year compared to handwashing. And it saves time!  "},{"tweet":"Saving energy is hard in the winter, but REC has some easy ways you can save energy this holiday season: turn off room lights when the Christmas tree is lit up, turn down the heat when guests are over, and avoid opening the oven door when checking your dish."},{"tweet":"Packing up to visit family this holiday season? Program your thermostat to 16C to reduce energy consumption and save money."},{"tweet":"How to configure your smart thermostat to save the most via"},{"tweet":"Looking for a way to save money this weekend?  Clean the coils in your refrigerator with a vacuum or dust mop and reduce its energy usage by 6% per year.  It's a boring chore, but it doesn't take long and it will save you quite a lot in 2020.  "},{"tweet":"Good morning, It’s a high of 43 degrees and 🌤 today.   A quick home tip for today: Using a dishwasher instead of handwashing saves you 5,000 gallons of water per year. If you have a dishwasher, use it.  "},{"tweet":"You can save on heating &amp; cooling costs by air-sealing your home! Weather-stripping and caulk are just two low-cost solutions for saving Learn more:"},{"tweet":"Are you looking to save energy during the cold winter months? Then start with these 5 simple and completely free techniques!"},{"tweet":"Martin Lewis the money saving expert has had his latest say on whether energy meters are worth it? read his article below if smart meters can help you save money 💸#energytips"},{"tweet":"More to save energy. "},{"tweet":"Looking to save money on at home? Here are 3 ways that you can \"level up\" your energy savings:"},{"tweet":"If you have a tank insulating it can save you 3-4% in costs. If your water heater feels warm to the touch, using can save you up to 16% annually in your water heating costs."},{"tweet":"What type of saver are you? Read our recent blog post to find out!"},{"tweet":"The cold weather season is here, and you may have turned on the heat already. Learn how to save money on heating with these helpful tips!"},{"tweet":"Tips to save you money &amp; help the environment. Photo - KCM. ~ Switch to LED lights ~ Seal leaks around your home ~ Heat &amp; cool with a programmable thermostat ~ Maintain your HVAC System: clean filters &amp; get tune-ups  "},{"tweet":"Winter is coming. Set your thermostat to 68 degrees. Every degree you lower your heat setting saves money on next month’s power bill. For more winter tips, visit: ❄️ "},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"What type of saver are you? Read our recent blog post to find out!"},{"tweet":"Looking for ways to save money and be more Choose energy-saving LED bulbs. Replace five bulbs and save up to $75 on energy costs."},{"tweet":"How to configure your smart thermostat to save the most via"},{"tweet":"Looking for ways to save this fall? Here are 6 ways that you can start saving energy as cooler weather arrives:"},{"tweet":"time. According to British Gas you could save £340 per year if you install a new condensing boiler and controls."},{"tweet":"October is National Energy Action month. Did you know that an 1\/8” gap under your door lets in as much air as if the door had a 2 ¼” hole? Sealing off leaks saves you money year-round!"},{"tweet":"13 devices that will save you money on your electric bill via"},{"tweet":"How to configure your smart thermostat to save the most via"},{"tweet":"One of the best ways to save money on energy bills is to ensure that you have efficiently insulated windows. But, what else can you do?  Take a look here &gt;   "},{"tweet":"U.S. energy use is about the same now as it was in 2000, despite economic growth of about 30%! Let’s keep working together to save energy, save money and help the environment.   "},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow shower heads and faucets to save 25% to 60% annually."},{"tweet":"Are your water fixtures old and inefficient? 🚿 Install low-flow shower heads and faucets to save 25% to 60% annually."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow shower heads and faucets to save 25% to 60% annually."},{"tweet":"Are your water fixtures old and inefficient? Install low-flow shower heads and faucets to save 25% to 60% annually."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Fall into energy savings with this tip... Seal all leaks around doors, windows, and electrical outlets to save up to 20% on your heating bill. The cost of materials is typically under $20."},{"tweet":"☀️⚡ ENERGY STAR certified appliances can reduce energy use by up to 65%. See how you can save."},{"tweet":"🏠🌳 Keep your home cool and opt to use a toaster oven. Get more tips on how to save energy this summer."},{"tweet":"☀️ Want to save energy this summer? Here are 6 easy ways to save on your power bill."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. ✨ They will reflect heat better, and you will save energy."},{"tweet":"Looking to save at home? Check out this blog for ways to level up your energy savings:"},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"What type of saver are you? Check out our latest blog to find out!"},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a toaster oven, microwave or convection oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Looking for easy ways to save You can use up to 90 percent less energy on lighting your home by upgrading to LEDs. Discover more tips here:"},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"Welcome natural sunlight and a refreshing breeze into your home on this beautiful Saturday by opening your blinds and windows! (And save money and energy in the process🤑🌳)"},{"tweet":"This one is for all the teachers who want to save energy at school. We found some helpful tips to save energy in the classroom, check them out!"},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save!"},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"What type of saver are you? Read our latest blog to find out!"},{"tweet":"If all clothes dryers sold in the US were certified, Americans would save more than $1.5 billion each year in energy costs and prevent 22 billion lbs of annual greenhouse gas emissions! For more visit:"},{"tweet":"Did you know it is best to use a clothes line to dry clothes whenever possible. Doing this can save up to 5% of your energy costs. For more visit:"},{"tweet":"When possible, use a convection oven, microwave or toaster oven instead of your range to save energy and avoid increasing room temperature."},{"tweet":"Brighten up your yard with solar-powered outdoor lighting and save."},{"tweet":"Looking for an easy, low-cost way to save at home? Turn your thermostat back a few degrees before heading out for the day. Learn more &amp; discover other energy-saving tips here:"},{"tweet":"Temps are expected to reach above 100 degrees today!!! Use these tips to save energy in this heat.    "},{"tweet":"Do you know how to save energy at home? There are some widely held myths that we’d like to bust once and for all:   "},{"tweet":"Looking to save at home? Check out this blog for ways to level up your energy savings:"},{"tweet":"Look for the Energy Star label when you buy new appliances, they help consumers save money on operating costs by reducing energy use without sacrificing performance. Check the Department of Energy’s efficiency standards."},{"tweet":"Keep your home cooler and save energy:  ☀️🏠 Close drapes and blinds during hot periods.  🚫🔌 Turn off all unnecessary appliances and equipment, and shut off lights when leaving a room.  🌡️ Set thermostats to no lower than 78. "},{"tweet":"Looking to save at home? Seal in the savings with these weatherization tips!"},{"tweet":"Looking for easy ways to save energy without breaking the rules of your lease? You can use up to 90 percent less energy on lighting your home by upgrading to LEDs! Discover more tips here:"},{"tweet":"Tips to save energy and stay cool: 🌡️ Set your A\/C to 78º  👕 Hang dry your clothing  🍽️ Run your dishwasher when it's full  ☀️ Use blinds to keep out heat.  "},{"tweet":"Looking for an easy way to save at home? Turn your thermostat back a few degrees before heading out for the day. Discover other energy-saving tips here:"},{"tweet":"You can save on heating &amp; cooling costs by air-sealing your home! Weather-stripping and caulk are just two low-cost solutions for saving energy and money. Learn more:"},{"tweet":"☀️ Check out these 6 ways you can save energy during the summer."},{"tweet":"🔌⚡ Keep your home cool and opt to use a toaster oven. Get more tips on how to save energy this summer."},{"tweet":"The dog days of summer are here! Use these 5 tips to save on your bills during the hot months to come:"},{"tweet":"The has gone mainstream! 🏠⚡️ Check out our blog for 3 smart home products can help you save on"},{"tweet":"⚡🔌🌟 ENERGY STAR certified appliances can reduce energy use by up to 65%. See how you can save this summer."},{"tweet":"Sunny summer days are perfect for letting laundry dry naturally, helping you save money and energy!"},{"tweet":"July is National Grilling Month! Grilling outdoors is a great way to save energy. Cooking with a stove or oven builds up heat in your home and makes your HVAC system work harder to keep you cool. Enjoy those summer evenings and save money."},{"tweet":"When celebrating the 4th of July, remember these no cost energy saving tips to help your family save on next month utility bill."},{"tweet":"Do you follow these tips for staying cool in the summer heat? See how you can keep cool and save on your power bill. 🥤☀️🕶️"},{"tweet":"☀️ Did you know running a fan and A\/C at the same time can help you save energy? Simply raise the thermostat about 4 degrees. This combined with a fan, will help you keep the same comfort level."},{"tweet":"Here's a cool trick: Fill a mixing bowl with ice and angle it in front of a large fan for a chilled, misty breeze. It'll also save on A\/C costs. ☀️"},{"tweet":"Summer is here! Use these 5 tips to save on your bills during the hot months to come:"},{"tweet":"Summer officially starts on Friday! Use these 5 tips to save on your energy bills during the hot months to come:"},{"tweet":"‼️It's Fact Friday‼️ Did you know that using a more efficient shower head could save you money⁉️⠀  🌟Apply today to save even more!🌟⠀  ⠀ "},{"tweet":"👚👖 Understanding your washer-dryer settings can help you save energy and prevent damage to your clothing."},{"tweet":"With temps soaring, a programmable thermostat can help save energy and save money!"},{"tweet":"❗Energy Tip❗  Apply Now to see if you qualify for one of our energy efficiency grants which could save you even more money! ▶ ◀  "},{"tweet":"👕👖 Washer and dryer settings can be complicated, but did you know that using the right one can help save energy in your home?"},{"tweet":"Visit our simple tips on ways to save energy and keep warm around the home.   Alternatively see if you qualify for a energy saving grant   "},{"tweet":"Make sure you turn off your unused devices at the plug!   Apply Now and see if you could save even more money!   "},{"tweet":"Service your air conditioner and replace filters to ensure optimal performance and save energy."},{"tweet":"🌶️ Using electric appliances can help restaurants save big. See how these chefs are cooking up energy-efficient Mexican fare."},{"tweet":"💡 These energy-efficiency tricks can help you save money and stay cool."},{"tweet":"Take advantage of the warmer weather and fire up the grill (it could actually save you money on your utility bill). Here’s a few recipes you might enjoy:   For more visit our website:"},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Like long showers? Give your electric heating bill a break. Go with VOLT Signature Night and Day plans and save money.  "},{"tweet":"Programmable thermostats can save up to $150 a year on energy costs when used properly. Get smart and save."},{"tweet":"Here’s an energy-saving tip for you:  Planning to buy a new dishwasher? Choose one with different cycles that adjusts to your cleaning needs &amp; get ready to save more energy! . . "},{"tweet":"Setting your a few degrees higher with a programmable thermostat while away from home is a great way to save on energy."},{"tweet":"More ways to save energy in pictorial."},{"tweet":"on books by investing in an Amazon Fire Tablet. The tablet allows users to download their favorite books with a touch of their fingertips. It has saved me money &amp; helped me cut my  Snag yours here:"},{"tweet":"The has gone mainstream! 🏠⚡️ Check out our blog for 3 smart home products can help you save on"},{"tweet":"🌡️ Lowering your water thermostat to 120˚ F may save up to 20% on costs."},{"tweet":"Plant 🌳  and save 💲. Sounds odd, but by strategically placing trees around your home, you can save up to $250 each year."},{"tweet":"Six ways spring cleaning can save via"},{"tweet":"Who doesn't love a little especially once spring hits. Here are three simple DIY projects to help you save around your home."},{"tweet":"To conserve energy in your household, turn appliances off when you’re not using them – a simple way to save.  "},{"tweet":"Using less hot water is a quick and easy way to save some money in the home and be kinder to the planet.  Let us know if you have any simple tips for energy saving in the home.  "},{"tweet":"Do you mostly use your pool on weekends? Try reducing the temperature by eight degrees during the week to save energy and money.   "},{"tweet":"Turning off water features when they aren't in use or putting them on an automatic timer not only saves energy—it also saves water that's lost to evaporation.   "},{"tweet":"6 energy-efficient home upgrades that can save you $1,000 a year  via"},{"tweet":"Today’s tip of the day is to wrap up and stay warm to save energy in your home 🙌 "},{"tweet":"Are you hosting a gathering? See how you can have fun and save money. 🏠👥🔌"},{"tweet":"Did you know hair dryers are the top energy-consuming beauty appliance? See other ways you can look good and save too. 💄⚡"},{"tweet":"Up to 80% in energy consumption was saved after villas were installed with bulbs. "},{"tweet":"The retrofit project enabled the company to save 74.2% in their electricity bills!  "},{"tweet":"Power Station Retrofit project saved up to 70% in energy consumption and reduced 9,805 tons of CO2! "},{"tweet":"🌱💄 These beauty tips can help you save energy while looking your best."},{"tweet":"6 energy-efficient home upgrades that can save you $1,000 a year via"},{"tweet":"A dirty furnace is a hard-working Change filters to save some energy and keep your furnace happy."},{"tweet":"Let the sun in! ☀️ Opening curtains during the day can help keep your home at a comfortable temperature and save on heating costs."},{"tweet":"Electronics can be a drain on your consumption...but how about some which may actually save you and ⚡️     "},{"tweet":"Do you know that planning your trips can help you save fuel? "},{"tweet":"Take a few minutes to walk around your home and make some of these changes to help save money on your energy usage!"},{"tweet":"Turn your down 5 degrees before you go to sleep or when leaving your home for a few hours. It can save money and energy."},{"tweet":"Don't forget to visit our simple tips on ways to save energy and keep warm around the home.   Alternatively see if you qualify for a energy saving grant   "},{"tweet":"According to around 10% of a home’s total electricity use goes to washing and drying clothes. Here are some tips to save while doing laundry:https:\/\/t.co\/b8zysxn4oz  "},{"tweet":"These great energy saving tips can help you save money in"},{"tweet":"Follow the tips below to save energy and reduce your electric bill!  "},{"tweet":"Have you swapped to LEDs yet?  Don't delay, save energy and money today 💡  Read our blog &amp; click through to request a lighting audit 📋     "},{"tweet":"Take shorter showers to save some in your home! Running the hot water for extra periods of time daily can get costly."},{"tweet":"Keeping your water heater's temperature on the warm setting (120°F) is a great way to save on costs."},{"tweet":"Get an Energy-saving Kit valued at $25 - for no cost!  Once you take the Online Energy Checkup - - a kit with LED bulbs and more will be mailed to your home. You’ll find out how your home uses energy, plus get tips to save more."},{"tweet":"Did you know using a cold-water cycle when you do the washing can save you up to $115 a year? Use less energy in summer and visit for more tips"},{"tweet":"Get an Energy-saving Kit valued at $25 - for no cost!  Once you take the Online Energy Checkup - - a kit with LED bulbs and more will be mailed to your home. You’ll find out how your home uses energy, plus get tips to save more."},{"tweet":"Some handy tips to help you save energy this Christmas 💡🎄  Article from      "},{"tweet":"Energy Tip: Reheat leftovers in your microwave or toaster oven to save energy."},{"tweet":"Get an Energy-saving Kit valued at $25 - for no cost!  Once you take the Online Energy Checkup - - a kit will be mailed to your home. You’ll also find out how your home uses energy, plus get tips on how to save more."},{"tweet":"Before you leave for work today, set the thermostat back several degrees: you'll save enough money to pay your favorite cup of joe at least once a week!  Learn more:"},{"tweet":"If you haven't already, make the switch to LED and save yourself some green this holiday season. "},{"tweet":"👕🧦 Doing laundry this week? Here are 16 tips to help you save from"},{"tweet":"Does your pot fit your kitchen burner? Using the right sized pots and pans can save you money."},{"tweet":"Putting up lights this weekend? Choose LED and save during the most wonderful time of the year."},{"tweet":"We may not have long here in California, but there will be weeks when the temperature will make you say \"should we turn on the heat?\" Before you do, try these home heating tips that will save you money and most importantly, keep you warm."},{"tweet":"Before you send off that list to Santa, make sure to ask for ENERGY STAR electronics to save you and money.  "},{"tweet":"🍽️ Choosing an air-dry cycle that uses unheated air can save about 15-50 percent of a dishwasher’s operational cost."},{"tweet":"Brighten up your neighborhood and save energy, too! It's possible with LED lights and timers. You'll never forget to turn those cheerful lights on and off again."},{"tweet":"If you rent your home, check out these saving tips that could save you money on your winter heating bill:   "},{"tweet":"Replace cracked or peeling caulk or weather stripping around doors and windows to save up to 10 percent on energy use."},{"tweet":"ENERGY TIP: Wrap your water heater with a water heater blanket to keep heated water warm.  For more ways to save visit"},{"tweet":"Visit our simple tips on ways to save energy and keep warm around the home.   Alternatively see if you qualify for a energy saving grant   "},{"tweet":"Lowering your water thermostat to 120˚ F may save up to 20% on costs"},{"tweet":"👚👖 Making simple changes in the way you use your washer or dryer can actually help save energy and money."},{"tweet":"ENERGY TIP: Check the weather stripping and caulking around doors and windows. Up to 20% of heat inside a typical house is lost through the windows.  for tips on how to save visit,"},{"tweet":"ENERGY TIP: For every two degrees that you lower your thermostat during the winter, you save about 10% on the operating cost of your heater.  For more ways to save visit"},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Fix leaky faucets and save! According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"Check out this simple tip that can cut your drying time and save you money"},{"tweet":"Fix leaky faucets and save. According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year. "},{"tweet":"Energy Tip for The Week! - Use the 'standby' or 'sleep' mode on computers and printers to save about 80% of energy consumed.  "},{"tweet":"Renting? There are many ways to save energy, and we can help.   "},{"tweet":"Switch to green energy – and save £250 on your bill"},{"tweet":"👕👖🧦 Laundry settings can be complicated, but knowing the right ones can save energy and money. Get washer and dryer hacks:"},{"tweet":"Turn down your thermostat 10 to 15 degrees before bed or when leaving the house and save around 10 percent a year on heating and cooling. A programmable thermostat can make it easy."},{"tweet":"U.S. energy use is about the same now as it was in 2000, despite economic growth of about 30%! Let’s keep working together to save energy, save money and help the environment. Learn more at "},{"tweet":"Fix leaky faucets and save. According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year."},{"tweet":"Fix leaky faucets and save. According to the U.S. Department of Energy, one drip per second wastes 1,661 gallons of water and can cost up to $35 a year."},{"tweet":"RT \"Did you know that many appliances use energy even when turned off? When shopping, choose ENERGY STAR® products that save energy when turned off. "},{"tweet":"Did you know that many appliances use energy even when turned off? When shopping, choose ENERGY STAR® products that save energy when turned off. "},{"tweet":"Unplug any unused appliances and electronics within your home to save money on utility bills."},{"tweet":"It’s definitely getting colder here in and Did you know? By turning down your thermostat just 1 degree, you can save £60 per year. Time to layer up! "},{"tweet":"As the days get shorter, take advantage of ways to save energy, like buying solar lights for your yard."},{"tweet":"Fall into energy savings with this tip... Seal all leaks around doors, windows, and electrical outlets to save up to 20% on your heating bill. The cost of materials is typically under $20."},{"tweet":"Are your water fixtures old and inefficient? Install high-performance showerheads and faucets to save 25-60 percent in water costs."},{"tweet":"Are your water fixtures old and inefficient? Install high-performance  showerheads and faucets to save 25 to 60 percent in water costs. "},{"tweet":"Are your water fixtures old and inefficient? Install high-performance showerheads and faucets to save 25-60 percent in water costs."},{"tweet":"Are your water fixtures old and inefficient? Install high-performance showerheads and faucets to save 25 to 60 percent in water costs.  "},{"tweet":"Are your water fixtures old and inefficient? Install high-performance showerheads and faucets to save 25 to 60 percent in water costs."},{"tweet":"Visit our simple tips on ways to save energy and keep warm around the home.  "},{"tweet":"Energy Tips for Everyone No matter what role or position a person is in, anyone can pitch in to save energy. Learn more about how employees, executives, and building managers can help"},{"tweet":"The main reason why a firm should understand half-hourly electricity prices is to save a substantial amount on their overheads, and you can make a start on that here:"},{"tweet":"Since account for a large part of a firm’s overheads, it is possible to save substantial amounts by switching providers:"},{"tweet":"your porch light is one of the most used lights in your home? Use LED bulbs to save on your electric costs without skimping on brightness. Learn more here."},{"tweet":"Are your water fixtures old and inefficient? Install high-performance shower heads and faucets to save 25 to 60 percent in water costs. CPI offices offer 2 free shower heads. Stop by and visit us today!"},{"tweet":"All firms should be looking at their overheads on a regular basis to save on costs &amp; swapping your business electricity supplier is an effective way to do this. But how easy is it to do in practice?"},{"tweet":"Using a ceiling fan in conjunction with your cooling system can allow you to raise your thermostat setting about 4 degrees without sacrificing any comfort, and can save you on your cooling bill."},{"tweet":"Want to save on cooling costs and improve air quality? Try cleaning or replacing your air-conditioner filter once a month or as recommended. Stay Cool!"},{"tweet":"Air leaks are among the greatest sources of energy loss in a home. You could save 10% - 20% on your heating and cooling bills by sealing all small openings to the outside."},{"tweet":"During Extreme Hot Weather Cooling Systems Work Harder. To reduce your energy use and save you money, raise your thermostat setting a few degrees."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Install a programmable to save up about 10% on your current heating and cooling expenses."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Keep range-top burners and reflectors clean. They will reflect heat better, and you will save energy."},{"tweet":"Older, less efficient light bulbs are big money drains. Switch to LED and you'll save money and energy. Instant rebates on LED bulbs are available now at "},{"tweet":" Office equipment accounts for around 15% of electricity used in UK offices.  Help motivate your team to save energy &amp; make your workplace more energy efficient with these handy employee awareness posters from the Carbon Trust "},{"tweet":"Going abroad? 🌴🌞 Instead of leaving lights on all week, use timer switches. You'll save money, save energy and still deter burglars! "},{"tweet":"Can you see light between your exterior door frame and the floor? You could save energy and money by installing new weather stripping. "},{"tweet":"Recycling 1 aluminum can saves enough energy to power a TV for 3 hours (Can Manufacturers Institute). . . "},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"Biz can save 2% on A\/C costs for each degree a thermostat is raised."},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"If it's hot out, don't use the oven! Try outside or just using the stovetop. It can save your the hard work."},{"tweet":"If it's hot out, don't use the oven! Try outside or just using the stovetop. It can save your the hard work."},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster instead of  your oven range to save energy and avoid increasing room temperature. "},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature."},{"tweet":"We only supply the highest quality in both bagged and blown deliveries - and we can save you up to £1356.60 a year (based on a medium sized business average energy spend per annum)"},{"tweet":"Have you taken our quiz yet? It might just save you some money!"},{"tweet":"When possible, use a convection oven, microwave or toaster instead of your oven range to save energy and avoid increasing room temperature. "},{"tweet":"Looking to save money on your bill? Check out these tips from  "},{"tweet":"Our this week is to get you a cheap quote &amp; try and save you at least £100:"},{"tweet":"Our is to help you to save money on your buisness bills, so why not contact us today to see how we can help?"},{"tweet":"💡 It's Tip Tuesday!  Going on vacation this summer? Try turning down your water heater while you're out this summer to save both energy and $$!"},{"tweet":"During this how can you save while off?  "},{"tweet":"BrooklynSolar TWT'd: RT ConEdison: As the heat wave rolls into the work week and the demand for power increases, we are offering tips to help customers stay cool and save on their energy bills."},{"tweet":"As the heat wave rolls into the work week and the demand for power increases, we are offering tips to help customers stay cool and save on their energy bills."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save $100 to $250 annually."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save $100 to $250 annually."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save $100 to $250 annually."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save $100 to $250 annually. "},{"tweet":"Its the first official day of Check out these strategies from to help you save while keeping your home cool."},{"tweet":"Plant trees and save. Strategically placed trees around the house can save $100 to $250 annually."},{"tweet":"Guess what! A programmable can save you as much as 15% on your heating and cooling costs. It allows you to set your thermostat to adjust during the day to work with your schedule."},{"tweet":"Guess what! A programmable can save you as much as 15% on your heating and cooling costs. It allows you to set your thermostat to adjust during the day to work with your schedule."},{"tweet":"Run your AC at 78° instead of 72° in the summer. Reducing the difference between indoor and outdoor temperatures can save 6 to 18 percent on your bill.  "},{"tweet":"Run your AC at 78° instead of 72° in the summer. Reducing the difference between indoor and outdoor temperatures can save 6 to 18 percent on your bill."},{"tweet":"Run your AC at 78° instead of 72° in the summer. Reducing the difference between indoor and outdoor temperatures can save 6 to 18 percent on your bill."},{"tweet":"Run your AC at 78° instead of 72° in the summer. Reducing the difference between indoor and outdoor temperatures can save 6 to 18 percent on your bill."},{"tweet":"Strategically placed trees around the house can save $100 to $250 annually. Through our Operation Cool Shade program, you can purchase up to 3 trees for $15. Trees are almost sold out for this year. Get yours before they're gone!"},{"tweet":"Are you looking to save substantially on your overheads, and improve your businesses profitability? Then you may need to think about switching your commercial energy supplier:"},{"tweet":"Some really useful here on how to switch your business water supplier easily, and potentially save yourself a lot of money:"},{"tweet":"Switch off lights in empty rooms and corridors - especially at the end of the day. This can save you up to 15% on your energy bill. "},{"tweet":"Keep your eyes peeled! with the label can help you save up to 30% on related bills."},{"tweet":"Keep your eyes peeled! with the label can help you save up to 30% on related bills."},{"tweet":"Keep your eyes peeled! with the label can help you save up to 30% on related bills."},{"tweet":"Switch off lights in empty rooms and corridors - especially at the end of the day. This can save you up to 15% on your energy bill.  "},{"tweet":"It’s time to start washing clothes, running our dishwashers and cooking as late in the evening as possible. This helps save energy when it’s hot outside."},{"tweet":"Sealing air leaks and insulating your home properly can save up to 20% on heating and cooling bills."},{"tweet":"Sealing air leaks and insulating your home properly can save up to 20% on heating and cooling bills."},{"tweet":"Sealing air leaks and insulating your home properly can save up to 20% on heating and cooling bills."},{"tweet":"A programmable can save you 10% on heating and cooling costs."},{"tweet":"A programmable can save you 10% on heating and cooling costs."},{"tweet":"A programmable can save you 10% on heating and cooling costs."},{"tweet":"Every business needs electricity to run, but did you know you can switch your business energy supplier and save money?"},{"tweet":"Small changes could save UK businesses millions on wasted energy reports"},{"tweet":"Here are some top on how to save money on your commercial utility bills when you are comparing prices:"},{"tweet":"When Spring cleaning, don’t forget your refrigerator coils. This simple step could save 10-20% on your energy bill."},{"tweet":"Did you know that washing your clothes in cold water can save you $63+ a year?"},{"tweet":"Programmable thermostats can save you up to 15 percent on heating\/cooling. Get smart."},{"tweet":"Looking to a few bucks? Washing all your clothes in cold water can save $63 a year!"},{"tweet":"Looking to a few bucks? Washing all your clothes in cold water can save $63 a year!"},{"tweet":"Looking to a few bucks? Washing all your clothes in cold water can save $63 a year!"},{"tweet":"Programmable thermostats can save you up to 15 percent on heating\/cooling. Get smart.   "},{"tweet":"Smart (programmable) thermostats can save you up to 15 percent on heating\/cooling. Get smart."},{"tweet":"Conserve power &amp; save money. Here is a spring cleaning energy tip that will do both."},{"tweet":"Pinching pennies? A programmable can save up to 10% on cooling and heating costs!"},{"tweet":"Pinching pennies? A programmable can save up to 10% on cooling and heating costs!"},{"tweet":"One way to save energy and money is to use lighting control devices.  "},{"tweet":"Do you know that cleaning your stovetop reflectors can save energy? Get into the spring cleaning mode by polishing yours to reflect heat and cut down your energy!"},{"tweet":"Savings Tips Maintain your refrigerator at 37 to 40 degrees for efficiency, and freezer at 5 degrees – this will save you money and better serve you!  "},{"tweet":"Do you know that cleaning your stove-top reflectors can save energy? Get into the spring cleaning mode by polishing yours to reflect heat and cut down your energy!  "},{"tweet":"Did you know that cleaning your stovetop reflectors can save energy? Get into the spring cleaning mode by polishing yours to reflect heat and cut down your energy!"},{"tweet":"Before heading off on your family reduce the temperature of your water heater to save money on your next bill."},{"tweet":"Here's a tip: Only run a dishwasher on a full-load. Don't worry about pre-rinsing; just scrape off leftovers and let your dishwasher do the rest of the work. Remember - saving energy saves money!"},{"tweet":"Investing in a multi zone system will save you money on your energy by only cooling the rooms you need."},{"tweet":"The energy eater warns us against opening the refrigerator too often in order to save more energy."},{"tweet":"3 Major home appliances you can replace to save money"},{"tweet":"that using cold water to wash your clothes can save you over $60 a year?"},{"tweet":"Sink saver: Keep faucets aimed at cold for light water use. Otherwise you waste hot water that never reaches you. "},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours.  Replace old bulbs with LEDs. "},{"tweet":"Sink saver: Keep faucets aimed at cold for light water use. Otherwise you waste hot water that never reaches you."},{"tweet":"Sink saver: Keep faucets aimed at cold for light water use. Otherwise you waste hot water that never reaches you."},{"tweet":"Sink saver: Keep faucets aimed at cold for light water use. Otherwise you waste hot water that never reaches you."},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours. Replace old bulbs with LEDs."},{"tweet":"Savings Hack You can save as much as 10% simply by turning down your thermostat a few degrees during the cold season!"},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours. Replace old bulbs with LEDs. "},{"tweet":"10 videos have been added to our channel with more tips for your home. Visit the link, look for the lady in blue, and discover ways you can save on"},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours. Replace old bulbs with LEDs."},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours. Replace old bulbs with LEDs."},{"tweet":"Helping you save is what we love!#EnergyTips "},{"tweet":"Helping you save is what we love! Here are some simple ways to save:"},{"tweet":"Happy Valentines Day! Helping you save is what we love!"},{"tweet":"Helping you save is what we love!"},{"tweet":"Happy Valentine’s Day from Delaware Electric Cooperative! Helping you save is what we love!#EnergyTips Follow the link to learn how to lower your bill:"},{"tweet":"LED bulbs save energy with less stress on your wallet and last about 25,000 hours. Replace old bulbs with LEDs!"},{"tweet":"Energy efficiency not only saves you money, it is also a great way to help conserve our natural resources.  Learn more from this"},{"tweet":"Thinking of redoing your room? Take this tip into consideration to save energy!  "},{"tweet":"Adding to the siding of a home is a great way to increase the Find out how much that upgrade can cost to install and how much it can save you in energy costs in our"},{"tweet":"RT placed around buildings can reduce air conditioning needs by 30% and save 20-50% in energy for heating."},{"tweet":"Batch cook meals. It saves energy but time as well. It doesn’t take much more energy 2 cook a double or triple serving of casserole. Freeze the leftovers into meal-size portions 2 reheat 4 another day.   source:"},{"tweet":"Installing a heating and cooling system saves energy and cuts down on energy costs. But how much does it actually cost you? Find out the cost of installation, including rebates and incentives, and the savings from our experts!"},{"tweet":"The MoneySavingExpert trick to keep your house warm AND save you money"},{"tweet":"The low temps and snows in the North East are no joke! To help reduce your bill and save energy you can lower your thermostat by 10-15 degrees before you go to bed"},{"tweet":"RT 🎉 Resolving to save energy in 2018? Check out our updated guide for quick and easy tips:"},{"tweet":"Durham AC Experts share tips on how to save energy in your home this winter!"},{"tweet":"Keep your home comfortable during these freezing temperatures and save energy with a high-efficiency"},{"tweet":"Looking for ways to save during the cooler months? Here’s a list of tips from"},{"tweet":"Did you get a new for Christmas? Don't forget this tip to help save energy!"},{"tweet":"Holiday travel tips to save energy and lower costs while you’re away!"},{"tweet":"Keep an eye on your heating use this Winter; Dropping the thermostat by only 1°C can save up to 10% on bills!"},{"tweet":"Could this trick save you big time on your"},{"tweet":"Quick tip to help save energy and your clothing while doing"},{"tweet":"Keeping an eye on your heating use this Winter? Dropping the thermostat by only 1°C can in fact save up to 10% on your bills!"},{"tweet":"4. Keep your garage door down. A warmer garage in the winter and cooler garage in the summer will save energy. Send us a tweet with  (U Conserve and Save)"},{"tweet":"Martin Lewis reveals how you could save up to £600 a year by switching to an energy firm you’ve never heard of:"},{"tweet":"Keeping an eye on your heating use this Winter? Dropping the thermostat by only 1°C can in fact save up to 10% on your bills!"},{"tweet":"Keeping an eye on your heating use this Winter? Dropping the thermostat by only 1°C can in fact save up to 10% on your bills!"},{"tweet":"Great tips to help save energy while cooking your meal!"},{"tweet":"Even though small kitchen appliances are convenient, you can save money and energy by unplugging them when not in use. "},{"tweet":"Keep your home comfortable and save energy with this quick day tip!"},{"tweet":"Lowering your buildings central heating by just 1°C will save you energy - 9 times out of 10 you won’t notice that extra degree."},{"tweet":"Combining an energy efficient heating system with a properly sealed and insulated home can save you up to 30% on annual energy costs."},{"tweet":"Switching to Compact Fluorescent or LED light bulbs saves up to 70% compared to standard bulbs"},{"tweet":"Want to save 4% to 22% annually on your electric bill?"},{"tweet":"Some for Learn how you can save energy and do good for the planet."},{"tweet":"Check out this simple tip that can cut your drying time and save you money"},{"tweet":"Today is Change some old bulbs to the newer, more energy efficient bulbs, and you will save on your bill!"},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Energy Tip of the day - To save paper try to use both sides for printing and copying!"},{"tweet":"Clean the filter on your dryer – this will help it run more efficiently, helping to save electricity"},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Hosting a garage sale? Pull the plug and put a price tag on your garage refrigerator or freezer to save on your electric bill."},{"tweet":"Install a programmable thermostat to save up to 10% on cooling and heating costs."},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year..."},{"tweet":"Clean the filter on your dryer – this will help it run more efficiently, helping to save electricity"},{"tweet":"Did you know? About 90% of the energy used for incandescent bulbs generates heat, not light. LEDs save energy and money."},{"tweet":"Switch to LEDs &amp; save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Keep your refrigerator compartment between 36-38 degrees &amp; the freezer compartment between 0-5 degrees to save on energy usage! "},{"tweet":"Switch to LEDs &amp; save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Switch to LEDs &amp; save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Keep your thermostat set above 78 degrees in the summertime to save on energy costs!"},{"tweet":"Switch to LEDs &amp; save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year...   "},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year..."},{"tweet":"Switch to LEDs and save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Switch to LEDs and save! LED bulbs use up to 90% less energy than incandescent bulbs."},{"tweet":"Cooking smaller quantities? Investing in a pressure cooker could save you energy and money (and time!)"},{"tweet":"Hot enough for you? Beat the heat and save energy with these 10 easy tips."},{"tweet":"Clean the filter on your dryer – this will help it run more efficiently, helping to save electricity   "},{"tweet":"When the heat is on, these simple tasks can help to keep you cool and save money this summer."},{"tweet":"Try using Sleep Mode on electronic devices. It can save nearly $100 a year."},{"tweet":"Save your fridge a little extra work, and defrost food in it! Saved energy = saved costs for you."},{"tweet":"Save on energy bill and switch to a water saver shower head. Will save about 7 gallons of water per shower."},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year...   "},{"tweet":"Energy inspections  can save you money! Not convinced? Hear out past savers  "},{"tweet":"Clean the filter on your dryer – this will help it run more efficiently, helping to save electricity"},{"tweet":"Unplug electronics when they aren't in use. By doing so, you're sure to save some money on your bill!"},{"tweet":"A 30°C wash saves over a third of the energy"},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year...   "},{"tweet":"Farewell hello Here are 10 things you can do to save money and energy this winter -"},{"tweet":"Energy is a big deal and you can do things to save it. See what you can do today!..."},{"tweet":"Stay warm, cut costs. Turning your thermostat down by just 1°C can save you as much as £60 per year..."},{"tweet":"As obnoxious as this may sound it could save you serious bucks  "},{"tweet":"Use smart strips to fight against vampire electronics &amp; save money on your energy bills!"},{"tweet":"energy efficient appliances can help save you money on your energy bills?"},{"tweet":"energy efficient appliances can help save you money on your energy bills?"},{"tweet":"Wash only full loads of dishes and laundry to save water and energy."},{"tweet":"Homeowners saved an average of 20% on their heating and cooling energy costs."},{"tweet":"These smart home gadgets will definitely help you save on your energy bill"},{"tweet":"Turn ceiling fans off when you leave the room to save money on your energy bill."},{"tweet":"Save energy by turning off your power strips. Takes a second, saves a bundle! "},{"tweet":"A water-saving showerhead can save you up to $0.04\/min or an average of $250\/year in water heating costs!"},{"tweet":"How do you save energy? Save some money with these tips that don't cost you anything!"},{"tweet":"An office elevator consumes 350 watts of electricity to travel one floor, so opt for the stairs to save energy and get exercise"},{"tweet":"Turn your water heater down to 120°F. You'll not only save energy, you'll avoid scalding your hands!"},{"tweet":"you could save up to £80 a year by turning off appliances on standby and unused chargers!"},{"tweet":"you could save up to £80 a year by turning off appliances on standby and unused chargers!"},{"tweet":"The direction your ceiling fan is spinning can help you save on costs!"},{"tweet":"Replace five light bulbs with LED bulbs &amp; you could save $75 a year! For LED Lighting"},{"tweet":"Worry no more entrepreneurs! Here are few easy ways how you can save energy"},{"tweet":"A system is a great way to save energy to heat or cool your home. Learn more in our video: "},{"tweet":"Seal air leaks on your windows and doors to save on heating and cooling costs!"},{"tweet":"Remove clothes from the dryer while they're still damp and hang them. This will save energy, prevent static &amp; reduce wrinkles."},{"tweet":"Washing your clothing in cold water can save you $63 each year"},{"tweet":"A great way to save energy is to adjust your water heater to the warm setting (120°)."},{"tweet":"Some energy saver tips for you   "},{"tweet":"Tips to save this February."},{"tweet":"Washing clothes in cold water can save you quite a bit of money each year."},{"tweet":"Cold weather means higher energy bills. Here are some to save on your heating bills. "},{"tweet":"Did you know there are game system settings to help save energy? Learn how in our video:"},{"tweet":"can be a big source of energy loss. Window replacement might save money over time. "},{"tweet":"Washing clothes in cold water can save up to $63 per year"},{"tweet":"For each degree you lower your in the 60 to 70 degree range, you can save up to 5% on costs."},{"tweet":"If you lower your thermostat 10 degrees for at least 8 hours a day, you can save about 10 percent on your energy bills."},{"tweet":"If you lower your thermostat 10 degrees for at least 8 hours a day, you can save about 10 percent on your energy bills."},{"tweet":"Take steps to save energy at your workplaces in this new year!"},{"tweet":"Follow this easy tip to save some energy at home !"},{"tweet":"If your holiday cooking doesn't heat up your house, your guests will. Turn your thermostat down 3-5° to save energy!"},{"tweet":"These will save your business some money this Follow the link to find out how."},{"tweet":"Keep your thermostat around 68° this winter to save on energy"},{"tweet":"Get smart and save this winter with these cold weather tips and tricks:"},{"tweet":"12 Days of Replace old holiday lights w\/ LEDs. They're cool to the touch &amp; can save..."},{"tweet":"12 Days of Replace old holiday lights w\/ LEDs. They're cool to the touch &amp; can save..."},{"tweet":"12 Days of Replace old holiday lights w\/ LEDs. They're cool to the touch &amp; can save up to 90% in energy costs."},{"tweet":"Cold weather means higher energy bills. Here are some to save on your heating bills."},{"tweet":"Following these will help you save money on your heating bills - what a great present!..."},{"tweet":"6 ways to save energy over Thanksgiving weekend!"},{"tweet":"If cooking doesn't heat up your house, your guests will. Turn your thermostat down 3-5 degrees to save energy!"},{"tweet":"Don't open the oven door, it can reduce the temp by 25-30 degrees. Use the oven light &amp; window to save energy!"},{"tweet":"Now that the cold weather is almost here, remember to set your thermostat so you can save some energy."},{"tweet":"Water heating accounts for 1\/5 of your total heating cost. Lower your water heater to a comfortable setting to save in big ways!"},{"tweet":"Save energy by turning off your power strips. Takes a second, saves a bundle! "},{"tweet":"Heat your home faster and save money. Replace your furnace filters the first of every month. "},{"tweet":"Apply plastic over the windows during the winter to help save on money and energy!"},{"tweet":"Did you know an easy to apply insulation can save you more than energy costs? Check out how"},{"tweet":"Scared of wasting energy\/money this Use these from to save some green for a"},{"tweet":"Turn down your thermostat to 68º. Every degree you lower your heat within 60-70 degrees, you'll save up to 5% on heating costs"},{"tweet":"These will help you save money — and even our beautiful green planet!"},{"tweet":"Learn about a few tips and gadgets to help save water &amp; energy in our video from last weekend's episode:"},{"tweet":"Drop the temperature on your thermostat a few degrees when you leave for the day to save energy."},{"tweet":"Upgrading your attic from 2 to 12 inches can save you upto 20% on winter heating costs!"},{"tweet":"Learn tips and tricks to save on your water heater bill and decrease your water usage in our video: "},{"tweet":"Did you know that by turning off the tap when you brush your teeth – you could save 6 litres of water per minute!"},{"tweet":"If you have a with a roof, this saves you electric bills low  "},{"tweet":"Turn your water heater down to 120°F. You'll not only save energy, you'll avoid scalding your hands."},{"tweet":"Building a new home? Learn how energy-efficiency investments can help you save money in the long run:"},{"tweet":"Go to our website to learn more about how you can save money on your energy bills!"},{"tweet":"Lower your thermostat when leaving the house to save on your utility bill."},{"tweet":"Changing bulbs can save you money. "},{"tweet":"Unplug to save energy and money."},{"tweet":"Did you know you can strategically plan your landscaping to reduce the use of your to save energy and utility costs?"},{"tweet":"Follow these tips to help you save both and money at home, at work and in your car:"},{"tweet":"Follow these tips to help you save both and money at home, at work and in your car:"},{"tweet":"The efficiency rating of a device can be a great determinant of how much energy it can save."},{"tweet":"Turn water off while shaving and brushing teeth - you'd be surprised to see how much that saves!"},{"tweet":"Check your filter! Changing a dirty AC filter saves money and saves strain on your unit."},{"tweet":"Check your filter! Changing a dirty AC filter saves money and saves strain on your unit."},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🗂🔬😋🎌"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 👞🤖🔮️"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to ⛄🔬🔑🍍"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to ️⛸⭐📸"},{"tweet":"RT  Switch off those energy draining appliances  to save energy  RT  to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🎽📐🐏🐋"},{"tweet":"great tips, I think if everyone did these then they would save lots too "},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 👚🐚🛀🎪"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🌂🍋🍡🌧"},{"tweet":"RT Switch off those energy  draining appliances to save  energy  RT to"},{"tweet":"RT Switch off  those energy draining appliances to save energy  RT to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🐷🍜📷🌷"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🌲☄🎻🐾"},{"tweet":"RT Switch off   those energy  draining appliances to save energy  RT to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT  to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🌿⚒📱💈"},{"tweet":"RT   Switch off  those energy draining appliances to  save energy  RT to"},{"tweet":"RT Switch off those energy    draining appliances to save energy RT   to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🐾⏱🙆🎨"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🏈⛈🖇🐡"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🏌🛋🗂🐈"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to"},{"tweet":"RT Switch off those energy  draining   appliances to save  energy RT to"},{"tweet":"RT Switch off those energy  draining appliances to save energy RT to"},{"tweet":"RT  Switch off those energy draining  appliances to save energy RT to"},{"tweet":"RT Switch off those  energy draining  appliances  to save energy RT to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🖊🏂🎾🎹"},{"tweet":"RT Switch off those energy draining appliances to  save  energy RT to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 🎱🐋💎😃"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to"},{"tweet":"RT Switch off those energy draining appliances   to  save  energy RT to"},{"tweet":"RT Switch  off those  energy  draining  appliances to save  energy RT to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT for the chance to"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 📃🏺🏹☄"},{"tweet":"RT Switch off those energy draining appliances to save energy RT to 📁🗺👽👕"},{"tweet":"Keep the heat in by using a lid when cooking to save energy. RT for the chance to"},{"tweet":"RT Switch off those energy draining appliances to save energy"},{"tweet":"thanks for the I ❤️ how I will able to save money using these"},{"tweet":"Keep the heat in by using a lid when cooking to save energy. RT for the chance to"},{"tweet":"Washing at a lower temperature could help you to save energy RT for the chance to"},{"tweet":"Switch off those energy draining appliances to save energy RT for the chance to"},{"tweet":"It's easy to save on energy bills with a little effort. Try these practical, DIY"},{"tweet":"Learn how to save with an energy-efficient refrigerator in our video:"},{"tweet":"100 ways to save energy in your home."},{"tweet":"It's hot. Cool down and save energy with our top 5 summer "},{"tweet":"Your dryer totals 6% of your annual Line dry your clothes instead &amp; save $$$!"},{"tweet":"Turn off your dishwasher’s heated dry to save energy and keep your house cool."},{"tweet":"📢 How to save on costs using smart technology🔌💰 "},{"tweet":"A few helpful tips to save at home this summer"},{"tweet":"Did you know? Using a low-flow shower head could help you conserve water and save"},{"tweet":"A few helpful tips to save at home this summer"},{"tweet":"Make sure your AC ducts are clear. You save money &amp; energy when air can flow freely."},{"tweet":" Yes, it saves money.  "},{"tweet":"Lower your thermostat whenever you leave the house to save energy!"},{"tweet":"Air drying clothes is a great way to save a few dollars!"},{"tweet":"How can the and smart meter help you save money on your electric bill?"},{"tweet":"By insulating the walls in your building it could save you 30-40% on your heating bill."},{"tweet":"Lower your thermostat whenever you leave the house to save energy!"},{"tweet":"Air drying clothes is a great way to save a few dollars!"},{"tweet":"The moths don't need an overnight light. Use a timer to save energy &amp; money!"},{"tweet":"Top 5 energy tips to save money on the blog now:  "},{"tweet":"Learn how you can save with this fun animation about"},{"tweet":"Watch this weekend for on how to save energy with kids at home! Find how out to watch in your area: "},{"tweet":"Insulate your walls and ceilings. This can save 20 to 30% on home heating bills and reduce CO2 emissions."},{"tweet":"MLEC wants to help save you $$$!"},{"tweet":"The moths don't need an overnight light. Use a timer to save energy &amp; money!"},{"tweet":"Want to save money?Try implementing these energy tips before summer hits:"},{"tweet":"Plugging home electronics to power strips &amp; turning off the power strips when the equipment is not in use saves a lot of energy"},{"tweet":"Who wants to save &amp; while having fun with the family at the same time?"},{"tweet":"Need some fresh spring air? Turn off your heating or cooling system to save on your electric bill."},{"tweet":"Lighting choices that will help you save money."},{"tweet":"Optimising the energy settings on your PC and other devices can be more than a modest energy saver"},{"tweet":"Need some fresh spring air? Turn off your heating or cooling system to save on your electric bill."},{"tweet":"Make the right water heater purchase. Heat pump water heaters can save a family of four $330 annually."},{"tweet":"Make the right water heater purchase. Heat pump water heaters can save a family of four $330 annually."},{"tweet":"RT Simple changes can make a big difference, switch off to save. RT to"},{"tweet":"Remember to program thermostat to 68° or lower, layer blankets on beds to conserve and save money "},{"tweet":"RT Switch off lights when not in the room to help save energy and money. RT to"},{"tweet":"fantastic this will save me lots of money off my bills"},{"tweet":"RT Most clothes can be washed at 30 degrees, turn the temperature down to save energy and money. RT to"},{"tweet":"Switch off lights when not in the room to help save energy and money. RT to"},{"tweet":"Simple changes can make a big difference, switch off to save. RT to"},{"tweet":"I boil my water in the kettle first, speeds things up and saves on gas"},{"tweet":"Simple changes can make a big difference, switch off to save. RT to"},{"tweet":"Most clothes can be washed at 30 degrees, turn the temperature down to save energy and money. RT to"},{"tweet":"Switch off lights when not in the room to help save energy and money. RT to"},{"tweet":"A Waste Water Heat Recovery System can help water heaters save energy. Learn more in our video:"},{"tweet":"Tune in this weekend to learn about maintaining your appliances to save energy! Stations &amp; Show Times:"},{"tweet":"Did you know? If you lower your thermostat 10 degrees for eight hours a day, you can save about 10% on your heating bills."},{"tweet":"Did you know? If you lower your thermostat 10 degrees for eight hours a day, you can save about 10% on your heating bills."},{"tweet":"Check, change furnace filter according to manufacturer’s directions. That can save 10% on heating bills."},{"tweet":"Check, change furnace filter according to manufacturer’s directions. That can save 10% on heating bills."},{"tweet":"A high-efficiency furnace that is at least 95% efficient can save you about 35-40% on your energy bill."},{"tweet":"Here’s how you can save energy at home with some of our favorite tips:"},{"tweet":"Energy costs can be especially high in the Winter. Use these tips to be more efficient and save some dollars on your next bill."},{"tweet":"Winter to help you save money (and the environment) "},{"tweet":"bulbs cost $5 but save $100+ in their lifetime. 80% less energy to deliver same light."},{"tweet":"Upgrade the five most used light fixtures in your home with Energy Star bulbs to save up to $75 a year."},{"tweet":"Setting your holiday lights on timers while you're away from home so they are not on during the day saves money"},{"tweet":"Fact or Fiction: Can you save money by closing heating vents?"},{"tweet":"Looking for ways to save money on your energy bill? Keep up with"},{"tweet":"Check out our 10 tips to help you save energy this Thanksgiving:"},{"tweet":"Programmable thermostats ensure you're only using your A\/C when you need. That equals comfort for you and saves cash!"},{"tweet":"Did you know that using cold water can save up to 80% of the energy  used to wash your clothes?"},{"tweet":"Put on a sweater instead of turning on the heat &amp; save on energy costs!"},{"tweet":"Have you gone out of your way to save energy this fall?  "},{"tweet":"Investing in newer, more efficient AC units can save you up to 40% on cooling energy costs!"},{"tweet":"Programmable thermostats ensure you're only using your A\/C when you need. That equals comfort for you and saves cash!"},{"tweet":"Boil water using a jug kettle and only boil as much water as you need. This can save you approx. £7 per year."},{"tweet":"Watch our video from last weekend's episode for quick tips to save hot water and energy in your home:"},{"tweet":"Motion sensing lights can save electricity."},{"tweet":"It's time for ! For more ways to save, visit"},{"tweet":"Programmable thermostats ensure you're only using your A\/C when you need. That equals comfort for you and saves cash!"},{"tweet":"Switch to energy saving appliances today and save on your electricity costs. TIPS"},{"tweet":"Investing in newer, more efficient AC units can save you up to 40% on cooling energy costs!"},{"tweet":"It's time for ! For more ways to save, visit"},{"tweet":"Find out how to save up to €700 a year on home energy bills with these simple tricks"},{"tweet":"RT You can save 3-5% on your air conditioning costs for each degree you raise your thermostat in the summer."},{"tweet":"Need to save money on your electric bill? Here's 5 DIY Tips to Save $50 or More on Your Monthly Bill"},{"tweet":"Charging unnecessarily or leaving your TV &amp; other appliances on standby can be costly. Switch them off &amp; save up to £30 a year."},{"tweet":"You can save 3-5% on your air conditioning costs for each degree you raise your thermostat in the summer."},{"tweet":"Air-dry your clothes instead of using the dryer. You'll save on power costs."},{"tweet":"Use lids on pots and pans when cooking. You'll use less power to heat and save on energy."},{"tweet":"Looking to save on energy in your home? Check out this infographic for some great tips!"},{"tweet":"Turning your thermostat down by 1°C can save you up to 10% on fuel bills."},{"tweet":"Dynamic Tip—Make sure your thermostat is set to AUTO, not \"ON\". You'll save an avg of $25\/mo!"},{"tweet":"Fit some draught-proofing products to doors &amp; windows and a chimney draught excluder in unused chimneys &amp; save up to £35 a year."},{"tweet":"Turning your heating down by just 1°C could cut 10% off your heating bill and save you around £55 per year."},{"tweet":"Top 5 energy efficiency tips to save:"},{"tweet":"The highest areas of heat loss are through the walls (35%) &amp; roof (25%). Insulating your home can save you up to £300 per year."},{"tweet":" Turn your Thermostat Down – Turning your thermostat down just 1°C could save as much as £55.00 per year"},{"tweet":"Investing in an energy-efficient home appliances saves you money in the long run."},{"tweet":"Investing in an energy-efficient home appliances saves you money in the long run."},{"tweet":"Keep your garage door down. A warmer garage in the winter and a cooler garage in the summer saves energy."},{"tweet":"Great deals to save you money on your energy utility bills from See if you can save!"},{"tweet":"Watch this weekend for tips to save energy and lower utility costs this summer. Stations &amp; airtimes:"},{"tweet":"Traveling? Five ways to save energy at home while you are away."},{"tweet":"Are you over heating your oven? Buy an oven thermometer and save"},{"tweet":"Are you over heating your oven? Buy an oven thermometer and save"},{"tweet":"Strategies to save energy with kids in this weekend's episode! View PowerHouse stations &amp; show times:"},{"tweet":"Is your oven lying to you? The small cost of an oven thermometer could save you lots of money and energy—and dry pot roasts."},{"tweet":"We need your help! We share a lot of to help our followers save $. Now we want to know your best tip?"},{"tweet":"Switch appliances off instead of leaving them on standby. This can save up to 20% of your appliances’ energy use!"},{"tweet":"10 handy ways to save money on your utility bills during these warmer months:"},{"tweet":"Here’s a great video with clothes drying tips via to help you save money at home! "},{"tweet":"Great MT Want more info on how to save while streaming? Check out this video! "},{"tweet":"Switch appliances off rather than leaving them on standby. This will save up to 20% of your appliances’ energy use."},{"tweet":"is 4\/22.  Make sure dimmer switches are all the way off to save energy."},{"tweet":"is 4\/22.  Make sure dimmer switches are all the way off to save energy."},{"tweet":"Looking for ways to save energy? Here's some handy that you can do around the home"},{"tweet":"Want to save money on heating this winter? Shut your blinds to cover the cold windows."},{"tweet":"Replacing single-paned windows with energy-efficient windows can save you about $360 a year in heating and cooling costs!"},{"tweet":"With colder weather this weekend, use to stay warm &amp; efficient! Keep your blinds closed and save $10-30\/year in heating costs"},{"tweet":"Sealing your air ducts could save $177 a year. Learn how:"},{"tweet":"Consider using timers to turn lights on in the morning and off during the day to save energy and power!"},{"tweet":"Use a bowl to wash up, rather than leaving the hot tap running to save water and energy."},{"tweet":"Catching up on the laundry this Dry two or more loads in a row to use the heat from the first load to save "},{"tweet":"Catching up on the laundry this Dry two or more loads in a row to use the heat from the first load to save "},{"tweet":"Buying smart helps you save.  Look for devices with ENERGY STAR® certification and use the label to compare energy usage."},{"tweet":"Buying smart helps you save.  Look for devices with ENERGY STAR® certification and use the label to compare energy usage."},{"tweet":"Check Out For some great Energy Great tips to save money!  "},{"tweet":"Simple steps to save energy during cold weather. Look for more energy tips throughout the weekend"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"US could save 1% of all household energy if everyone switched washing machines from hot wash,warm rinse to warm wash,cold rinse"},{"tweet":"7 home improvements that will save you money this winter: via"},{"tweet":"7 home improvements that will save you money this winter: via"},{"tweet":"7 home improvements that will save you money this winter: via"},{"tweet":"Give your bill a vacation this weekend while you’re away. Lower blinds to slow temp. fluctuations and save"},{"tweet":"Give your bill a vacation this weekend while you’re away. Lower blinds to slow temp. fluctuations and save"},{"tweet":"Appliances use even when turned off. Unplug them while on vacation to save and money."},{"tweet":"Appliances use even when turned off. Unplug them while on vacation to save and money."},{"tweet":"How can a water heater affect home energy usage? Find out and save on your bills:"},{"tweet":"7 home improvements that will save you money this winter: via"},{"tweet":"Is your working efficiently? A high-efficiency furnace that is 95% efficient can save about 35-40% on your energy bill!"},{"tweet":"7 home improvements that will save you money this winter: via"},{"tweet":"Did you know a fridge is more efficient full than empty? Load up bottles of H20 to save when out of town!"},{"tweet":"Tip#30 A family of four will save around £75 a year by installing an eco-showerhead "},{"tweet":"Open your blinds right now to let the sun into your home or office. It can save money on heating!"},{"tweet":"Before your dryer cools down, throw in another load and save"},{"tweet":"Before your dryer cools down, throw in another load and save"},{"tweet":"When you're asleep or out turn your thermostat to 10°-15° for 8hrs &amp; save 10% a year on your heating &amp; cooling..."},{"tweet":"By installing a room thermostat, programmer &amp;  thermostatic radiator valves, you could save up to £70 to £150 a..."},{"tweet":"When you're asleep or out turn your thermostat to 10°-15° for 8hrs &amp; save 10% a year on your heating &amp; cooling..."},{"tweet":"It’s colder outside, that means warm water will feel hotter. Turn down your water heater to save energy."},{"tweet":"Draught-proofing products-sealant, draught strips or chimney draught excluders - could save between £20-£30 a year"},{"tweet":"is here. Check out our page for to help you save and stay warm!"},{"tweet":"90% of washing machine energy expenditure goes on heating the water, wash at 30-40 degrees &amp; save significant amounts of money!"},{"tweet":"Tip#28 Are you prepared to stay cosy?  A 5 minute job can save you £s "},{"tweet":"Home Tips: Learn how to program your thermostat to save you money:"},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save you on your energy bill."},{"tweet":"In order to save energy, keep your fridge full."},{"tweet":"By using all you could save as much as two thirds off your energy bills"},{"tweet":"Did you know lights come in a variety of sizes &amp; types and simply by choosing the right one you can save energy?"},{"tweet":"Stay warm and save as the chilly weather approaches with these tips!"},{"tweet":"In each room you will find a number of different tips and programs designed to help you save energy."},{"tweet":"AC helpful tips. How to save energy.  "},{"tweet":"Did you know that can save you on your costs? Here is how"},{"tweet":"RT Energy-efficient set-tops have saved $168M in electric bills: "},{"tweet":"Energy-efficient set-tops have saved $168M in electric bills: "},{"tweet":"Check out these 5 simple ways to save money on your air conditioning   "},{"tweet":"An energy saving dryer vent closure controls the air that gets into your house and can save 10% of the energy your dryer uses."},{"tweet":"Two ways to save and stay green this winter"},{"tweet":"Use lids on saucepans and the right size pan for the cooking ring to save energy and money while cooking!"},{"tweet":"Raising the thermostat 1 degree can save 2 percent on your cooling bill. Learn more energy saving tips"},{"tweet":"DYK? You can save up to $200\/year by sealing and insulating your home!"},{"tweet":"Tankless water heaters only heat the water you use, helping you save energy and money."},{"tweet":"Did you know switching energy supplier could save you more than £100 on your gas and electricity bill?"},{"tweet":"Did  you know by turning your thermostat 1°C can save you as much as £60 per year"},{"tweet":"Learn how to program your thermostat to save money during the summer:"},{"tweet":"You can save money with a 123 Santander bank account, which gives you cashback on your household bills!"},{"tweet":"Energy Tips - Insulate uninsulated cavity walls can save you £140 yearly....."},{"tweet":"RT Window treatments are not only for decoration, but can also help you save energy."},{"tweet":"Having an audible carbon monoxide alarm could wake you save you and your families life."},{"tweet":"Window treatments are not only for decoration, but can also help you save energy. Which is best for you?"},{"tweet":"Here are a few tips for creating an energy efficient home that will save you money:"},{"tweet":"The has a free home energy check tool which can help you save money in your home"},{"tweet":"You could save £70 to £150 if you install a room thermostat and £30 if you fit a thermostat on your hot water tank.."},{"tweet":"Anything to help you save energy &amp; money :) There's still more you can do refer 2 page 6"},{"tweet":"Check energy efficiency ratings on equipment. Higher ratings = more efficient = more money saved!"},{"tweet":"- Why not snub the bathtub just once a week for 5 minute shower. You will save £25 a year on water bills."},{"tweet":"-  You can save money buy installing a thermostat in a room or on your hot water tank..."},{"tweet":"If you have a programmer, set your heating and hot water to come on when needed, rather than all the time, to save you money."},{"tweet":"Making dinner on the BBQ tonight will not only save you energy it will help keep your house cooler than using the oven."},{"tweet":"With summer just around the corner, how will you save this season? Share your tips using"},{"tweet":"Check out these videos from and for helpful tips on how to save energy at home "},{"tweet":"Check if you qualify for the Warm Home Discount scheme with your supplier, which can save you up to £140 per year on your bill"},{"tweet":"Efficient laundry this summer is hanging clothes or only full loads in the dryer. Cold water to rinse clothes can save 4%"},{"tweet":"When was the last time you spent $10 to save $100?"},{"tweet":"Did you know you could save £45 per year by changing regular light bulbs to LEDs?"},{"tweet":"Did you know a typical household could save between £45 and £80 a year by turning off appliances left on standby?"},{"tweet":"Did you know upgrading just 15 incandescent light bulbs can save you $50 a year."},{"tweet":"We all like to save money, check out these tips to help lower your energy bill."},{"tweet":"MT Lowering your water heater temperature to 120 degrees Fahrenheit can save you 3-5% in water heating costs."},{"tweet":"MT Lowering your water heater temperature to 120 degrees Fahrenheit can save you 3-5% in water heating costs."},{"tweet":"Lowering your water heater temperature to 140 to 120 degrees Fahrenheit can save you 3-5% in water heating costs."},{"tweet":"If you upgrade to a programmable thermostat you can save over $100 a year on your energy bill!"},{"tweet":"Turn down the brightness on your setting to suit your needs and save energy when you're watching tonight"},{"tweet":"Home Tips: Learn how to program your thermostat to save you money:"},{"tweet":"Did you know that desktops can use up to 85% more electricity than laptops..RT if you save energy using laptops. "},{"tweet":"Did you know that you can save over £43 a year if you set your washing machine to wash at 30°C...."},{"tweet":"Insulate your hot water heater to save on costs. info from"},{"tweet":"can save you money on your bill. Read our blog for tips!"},{"tweet":"How can a water heater affect home energy usage? Find out and save on your bills:"},{"tweet":"Battling phantom power? The ultimate weapon is the power bar! Switch them off when not using the electronics to save energy"},{"tweet":"Just by changing the filters on your furnace could save you up to 5% on your heating bill!"},{"tweet":"Reduce drafts to save $$. Caulk &amp; weather stripping make a big difference! Watch:"},{"tweet":"Replace incandescent bulbs w\/ CFLs to save $1200. Find a local retailer:"},{"tweet":"Smart savings start with smart customers. Make sure you know how much your spending on energy. Chances are, you can save!"},{"tweet":"We’ll pick up your old fridge and give you $40. Plus you’ll save on energy bills."},{"tweet":"- Trim the impellers of pump to the right size and save in your industry."},{"tweet":"Install low-flow showers in your home. Their pressure is better and they save a lot of hot water, plus energy producing it."},{"tweet":"Mass Savers, you can save up to $60 on water this year simply by setting the water heater temp to 120 degrees!"},{"tweet":"Home Tips: Learn how to program your thermostat to save you money:"},{"tweet":"Here are a few tips for creating an energy efficient home that will save you money:"},{"tweet":"Tip Insulate your cavity walls. An average insulation costs between £450 and £500 and can save up to £140 a year."},{"tweet":"Saving Money &amp; Saving Energy are two great things! Learn more that can help you save! (http:\/\/t.co\/03T5oyqlTZ)"},{"tweet":"Are you leaving town this weekend?  Don’t forget to turn your thermostat down to save "},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save you on your energy bill."},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save you on your energy bill."},{"tweet":"Remember, remember... To appliances off at the wall! You will save £ on bills."},{"tweet":"How can a water heater affect home energy usage? Find out and save on your bills:"},{"tweet":"Turning appliances off instead of leaving them on standby can save you up to £37 per year"},{"tweet":"Importance of sealing. Sealing leaks around doors, windows, and electrical outlets can save 20 per cent on your heating bill."},{"tweet":"Monday! How do you save energy? Here are some great Home energy saving tips!"},{"tweet":"Weekend Answer. Reverse the airflow on your CEILING FAN and save big on heating. at"},{"tweet":"Home Tips: Learn how to program your thermostat to save you money:"},{"tweet":"Here are a few tips for creating an energy efficient home that will save you money: "},{"tweet":"Are you a drinker? When boiling water, use an electric kettle rather than the stove to save energy -"},{"tweet":"Wash your clothes at 30 degrees and you will save energy, but your washing machine might tip over."},{"tweet":"What have you been utilizing this summer to conserve and save?  We will share some of the best with our followers!"},{"tweet":"Lower the Thermostat on Hot Water Heater to 120° F. This alone can save you between 3%–5% in energy costs."},{"tweet":"Lower the Thermostat on Hot Water Heater to 120° F. This alone can save you between 3%–5% in energy costs."},{"tweet":"Have a weekend! If you're planning to work around the house, check out these to help you save!"},{"tweet":"Changing the A\/C thermostat from 72 to 78 degrees can save up to 12% of your cooling costs."},{"tweet":"Got your own secret ways on how to save energy? RT us your"},{"tweet":"Simple MT Remember to turn off lights in a room when they are not needed. This simple gesture will save you money."},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save money on your energy bill."},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save money on your energy bill."},{"tweet":"Buying a new appliance? Make sure it's rated to receive rebates and save energy!"},{"tweet":"Unplugging gadgets when not in use may save 5-10% to your bill. For more see"},{"tweet":"What RT For every degree you turn up the thermostat, you could save 2% to 3% on your cooling bill."},{"tweet":"To my work, “@VectrenStorm: For every degree you turn up the thermostat, you could save 2% to 3% on your cooling bill."},{"tweet":"For every degree you turn up the thermostat, you could save 2% to 3% on your cooling bill."},{"tweet":"Unplugging gadgets when not in use may save 5-10% to your bill. For more see"},{"tweet":"How can a water heater affect home energy usage? Find out and save on your bills:"},{"tweet":"You will save 3-5% on air conditioning costs for each degree that you raise your thermostat"},{"tweet":"Unplugging gadgets when not in use may save 5-10% to your bill. For more see"},{"tweet":"Seal air leaks and properly insulate to save up to 20% on cooling bills, while also increasing home comfort."},{"tweet":"Using low-flow faucets and shower heads will help save on water bills."},{"tweet":"Washing clothes in cold water will save $63 a year."},{"tweet":"Use renewable energy at home such as solar and wind to save energy dollars while reducing environmental impact."},{"tweet":"\"@350: Build more wind turbines, save billions of dollars. What's to lose?\""},{"tweet":"Replacing your old HVAC unit can save you up to 50% on your bills:"},{"tweet":"Lowering the thermostat on your water heater already saves you a lot of energy. More at"},{"tweet":"Don’t let hot water run when shaving or doing dishes, this will help save energy and money."},{"tweet":"Now that is here, have your heater cleaned &amp; tuned. Save save money, &amp; avoid emergencies in the Fall!"},{"tweet":"Sealing up air leaks in your home's attic hatch will often save the most energy &amp; money. Big Bang for a just few bucks!"},{"tweet":"Turn your water heater down to 125 degrees to save money on your utility bill - and to avoid scalding yourself!"},{"tweet":"Learn how to air seal your home to save Follow our pins to get like this and more."},{"tweet":"RT To celebrate we are sharing tips &amp; advice to help you save energy at home"},{"tweet":"How to save on# energy and lower costs using flow metering"},{"tweet":"Keep your refrigerator thermostat between 38º- 42º F and vacuum the coils at least once a year to save electricity."},{"tweet":"that by turning down your thermostat by 2°C can save you 6% on home energy use?"},{"tweet":"Let your pants blow in the breeze rather than using a dryer! You'll save a lot of energy and money!"},{"tweet":"here's my blog post on how to save energy at schools!"},{"tweet":"Energy drips, energy tips! Here's a video on how to save money and energy in your home!"},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save you on your energy bill."},{"tweet":"Remember to turn off lights in a room when they are not needed. This simple gesture will save you on your energy bill."},{"tweet":"To save energy in your home, consider air-drying clothes on clothes lines or drying racks, especially when the weather warms up!"},{"tweet":"To save energy in your home, wash your clothes in cold water using cold-water detergents whenever possible."},{"tweet":"You can save 10% a year on heating and cooling bills by simply turning your thermostat back 10% to 15% for 8 hours."},{"tweet":"Use cold water to wash dishes and clothes. This will save on water heating costs."},{"tweet":"Keep your refrigerator thermostat between 38º and 42º F and save electricity."},{"tweet":"Make your business a bike-friendly one and save on energy costs!"},{"tweet":"Fixing a dripping hot water tap saves enough hot water in one week to fill 1\/2 a bath"},{"tweet":"How do you encourage your kids to be energy savers?"},{"tweet":"Homes lose 25% of heat through the roof – insulate to recommended depth of 270mm &amp; save up to £175 on your annual energy bills"},{"tweet":"Insulating your loft and walls could save you up to £310 a year on your fuel bills depending on your property type"},{"tweet":"Sick of paying through the roof for your fuel bills? Why not #insulate your loft &amp; save up to £175, its a quick &amp; easy #DIY job"},{"tweet":"Keep your thermostat at 68F or lower to save. You save about 3% on  heating costs for each degree you lower your thermostat."},{"tweet":"Homes lose 25% of heat through the roof – insulate to recommended depth of 270mm &amp; save up to £175 on your annual energy bills"},{"tweet":"Visit this website for a virtual tour on how to save energy on the various rooms in your home or apartment!"},{"tweet":"Did you know? Keeping your fridge around 3\/4 full helps save energy"},{"tweet":"each one-degree thermostat change can save up to 5% on heating and cooling   use &amp;"},{"tweet":"Turn off the tap when you brush your teeth and save 7-12 liters of water per minute."},{"tweet":"Check out this checklist to see what you can do to save energy in your home or apartment."},{"tweet":"Every 10° decrease on your water heater thermostat, saves you 5% on water heating costs. 120° is comfortable for most."},{"tweet":"Most water heaters only require a setting of 120 degrees.  Lowering the setting of your water heater thermostat can save you..."},{"tweet":"Carefully positioned trees can save up to 25% of the energy a typical household uses."},{"tweet":"Insulating outlets located on exterior home walls can help prevent energy loss and save on energy costs."},{"tweet":"Try turning your water heater temperature down 10 degrees to save up to 5% in energy costs."},{"tweet":"Fixing leaky faucets and plumbing joints can save up to 20 gallons per day for each leak."},{"tweet":"Keep your refrigerator between 37° and 40°F and your freezer at 5°F to help save energy."},{"tweet":"If you take a 10-minute shower, a low-flow shower head will save 5 gallons of water over a typical shower"},{"tweet":"Unplugging unused electronics can save 75% per year of the energy you use to power electronics and appliances."},{"tweet":"Adjust your thermostat. Setting your air conditioner 5° higher will save up to 20% on cooling costs."},{"tweet":"Install exterior or interior storm windows, which can reduce heat loss by 25%-50% and help save on energy costs."},{"tweet":"Use a pool cover to reduce water loss through evaporation and save up to 50%-70% on your pool heating costs."},{"tweet":"Looking to save money and energy this Try these from"},{"tweet":"Did you know? Enough energy is saved by recycling one aluminium can to run a TV set for three hours."},{"tweet":"RT Ways to save on your fridge and stove."},{"tweet":"Many electronics still suck energy even when they’re turned off, unplug your electronics to save"},{"tweet":"Using your dishwasher instead of washing dishes by hand can save water"},{"tweet":"RT‏ - Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT  Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"Time to get ready for next summer! RT Fixing air leaks is quickest way to save More at"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"RT Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"Fixing home air leaks is the quickest way to save For more explore the new"},{"tweet":"Only run full loads in the dishwasher and clothes washer.  Less loads means money and energy saved"},{"tweet":"Want to save water? Start with an aerator!"},{"tweet":"Set power management on ur computer so it hibernates when you're not using it. Add a SmartStrip and save lots."},{"tweet":"Tip 3 - Ride your bike whenever you can.  You'll save energy and you'll stay in shape at the same time"},{"tweet":"RT MT - Plant more trees: it could save you thousands this summer"},{"tweet":"MT - Plant more trees: it could save you thousands this summer"},{"tweet":"“Switch off your entire home entertainment system at night to save energy”. More at"},{"tweet":"from the that could save you thousands this year"},{"tweet":"“Use energy efficient air conditioning over portable heating to save $ in winter” More "},{"tweet":"from the that could save you thousands this year"},{"tweet":"Take lights down promptly after the holidays to help save energy."},{"tweet":"Seal exposed ductwork to help save on energy bills."},{"tweet":"1 Turn your water heater down to 120 deg F to save money on your energy bill. It's also safer for kids!"},{"tweet":"Turn your water heater down to 120 deg F to save money on your energy bill. It's also safer for kids!"},{"tweet":"Programmed appropriately \u0096 a programmable thermostat only saves energy when it is programmed."},{"tweet":"Dispose of older incandescent lights and buy new LED holiday lights - they can save up to 90%"},{"tweet":"Putty-like \"rope caulk\" can help seal large cracks and save you up to 5 percent on your energy bill."},{"tweet":"RT  RT Did you know that LED lights can save up to 90% on energy costs?"},{"tweet":"Great tip for short  winter days. RT Did you know that LED lights can save up to 90% on energy costs?"},{"tweet":"Did you know that LED lights can save up to 90% on energy costs?"},{"tweet":"Set-back thermostats can save up to 15% on energy costs."},{"tweet":"Did you know that LED lights can save up to 90% on energy costs?"},{"tweet":"New Virtual Profile software helps cut use, save"},{"tweet":"Sealing air leaks in your home can help you save money off monthly utility bills (via"},{"tweet":"Shorten showers. Reducing that time can save hundreds of gallons of hot water per month for a family of four. "},{"tweet":"Sealing air leaks in your home to save money off monthly utility bills"},{"tweet":"Sealing air leaks in your home can help you save money off monthly utility bills"},{"tweet":"Shorten showers. Reducing that time can save hundreds of gallons of hot water per month for a family of four. (via"},{"tweet":"In warmer climates, select windows with spectrally selective coatings to reduce heat gain and save energy."},{"tweet":"RT A GPS system will save fuel if you travel to a lot of new, unfamiliar destinations."},{"tweet":"An important way to save energy is to carefully evaluate energy consumption, when buying or replacing industrial equipment."},{"tweet":"You'll save money in the long run and keep hazardous materials out of our environment with rechargable batteries."},{"tweet":"New air conditioners today can save 30%-50% of the energy used to cool your home!"},{"tweet":"An easy way to save energy is to install programmable thermostats in your office or business. "},{"tweet":"RT Energy Awareness Month is coming to an end. Turn off lights to save energy, money & lower greenhouse gas emissions."},{"tweet":"Energy Awareness Month is coming to an end. Turn out the lights to save energy, save money & lower greenhouse gas emissions."},{"tweet":"When using a cell phone, save energy by shutting off your engine and turning the ignition to the accessory mode. "},{"tweet":"RT You'll save money ... and keep hazardous materials out of our environment with rechargeable batteries."},{"tweet":"Dry 2 or more loads in a row to take advantage of the heat from your dryer. More ways to save energy:"},{"tweet":"RT Use a programmable thermostat to help save energy:"},{"tweet":"Using heavy equipment during off peak hours, is a good way to save energy."},{"tweet":"Performing a professional energy audit of your business is a good method to find new ways to save energy."},{"tweet":"Use a programmable thermostat to help save energy:"},{"tweet":"Providing the right task lighting can save up to 15 percent on your lighting bill vs. overhead lighting."},{"tweet":"TIP1: Replacing an old G Rated boiler with an A Rated boiler can save up to £300 in fuel bills"},{"tweet":"Keep track of your utility bills to see how much you can save."},{"tweet":"Turn off office equipment especially overnight and on weekends. This can save as much as $44 per year, per computer."},{"tweet":"An important way to save energy is to carefully evaluate energy consumption, when buying or replacing industrial equipment."},{"tweet":"Install dimmer switches to save energy and extend the life of light bulbs"},{"tweet":"An easy way to save energy is to install programmable thermostats."},{"tweet":"High-Efficiency (HE) washers can save money on electricity:"},{"tweet":"A GPS system will save fuel if you travel to a lot of new, unfamiliar destinations. "},{"tweet":"Setting your thermostat up 10-15 degrees can save 5-15% on your cooling bill:"},{"tweet":"Turn off your engine when fueling up. It saves fuel and lowers emisions that polute our atmosphere."},{"tweet":"Installing skylights for natural lighting is one of the best ways to save energy."},{"tweet":"Share rides to work, school, church and social activities. You'll make new friends and save valuable fuel."},{"tweet":"Did you know that front-load he washers can save up to 70% of the electricity used?"},{"tweet":"Raise the temperature when you're not home in the summer to save energy:"},{"tweet":"Are your ducts leaking money? Sealing your air ducts could save you hundreds."},{"tweet":"You'll save money by not using premium unleaded gas."},{"tweet":"84% of US homes use air conditioners. Here's how to keep cool without them (and save energy!):"},{"tweet":"Pay a small reward to employees who suggest new ways to save energy."},{"tweet":"If a majority of employees live in the same part of town, consider relocating the business to that area to save energy."},{"tweet":"Use a commercial car wash that recycles water to save water and prevent toxic runoff. "},{"tweet":"Electronics draw electricity when plugged in - even if they're turned off. Unplug them to save an average of 10% annually!"},{"tweet":"Have an energy meeting with your employees and co-workers to discuss ways to save energy."},{"tweet":"Lower the thermostat on your water heter and check out more of our 6 ways to save money:"},{"tweet":"Pay a small reward to employees who suggest new ways to save energy."},{"tweet":"Great suggestion! RT Have a family meeting to discuss ways you can save energy at home."},{"tweet":"RT An easy way to save energy is to install programmable thermostats in your office or business. "},{"tweet":"RT Buy an energy-efficient air conditioner to save money:"},{"tweet":"Buy an energy-efficient air conditioner to save money:"},{"tweet":"Have a family meeting to discuss ways you can save energy at home."},{"tweet":"Keep track of your utility bills to see how much you can save."},{"tweet":"Closing off and insulating unneeded windows and other openings is one of the simplest ways to save energy."},{"tweet":"Set the water level on your washer to match the size of the load to save energy and water."},{"tweet":"Among the many ways to save energy, one of the simplest is to install a locked cover over the thermostat."},{"tweet":"New air conditioners today can save 30%-50% of the energy used to cool your home!"},{"tweet":"Beautify your home and save money on energy:"},{"tweet":"RT An easy way to save energy is to install programmable thermostats in office or business"},{"tweet":"RT Using heavy equipment during off peak hours, is a good way to save energy."},{"tweet":"Want to save a bunch of money in one easy step? A low-flow shower head can save $145 over a year!"},{"tweet":"Reading on how to save energy on the subway!"},{"tweet":"Get smart & save energy with Active Smart technology from Fisher & Paykel! "},{"tweet":"Here’s something you may not know that could save energy: a full freezer\/refrigerator uses less electricity."},{"tweet":"Ways to save this winter Share your"},{"tweet":"Here at Fisher & Paykel we strive on being What do you do to help save energy?"},{"tweet":"Keep track of your utility bills to see how much you can save."},{"tweet":"Set the water level on your washer to match the size of the load to save energy and water."},{"tweet":"Install low-flush toilets to save water. Many communities have water conservation programs that may pay for the new toilets."},{"tweet":"Fun site shows you how to save energy with a southern twist:"},{"tweet":"Fun site shows you how to save energy with a southern twist:"},{"tweet":"Fun site shows you how to save energy with a southern twist:"},{"tweet":"Check out these 100 tips to save money and energy today or anyday of the year!"},{"tweet":"Check out these 100 tips to help you save energy and money all year long:"},{"tweet":"Energy tips so easy, you'd be crazy not to do them. Think of all the money you'll save:"},{"tweet":"Wow! 100 Energy saving tips to help you save money. Check them out:"},{"tweet":"Wrap your water heater in an insulating blanket & save $2 a month on your Check your labels on the tank first."},{"tweet":"9 tips to save energy during winter. -"},{"tweet":"It's a common misconception that screen savers reduce energy use by monitors; they do not. Schedule auto sleep mode instead!"},{"tweet":"Q=VA. Reduce size of the jet & increase velocity. Warmer water from less time in air, save on heating costs."}]